tf1.org
#+TITLE: tf1
#+OPTIONS: num:nil
#+SETUPFILE: https://fniessen.github.io/org-html-themes/setup/theme-readtheorg.setup
#+STARTUP: content
* Tensorflow
** Constand additional und multiply
*** addition
#+BEGIN_SRC python   :results output :session
  import tensorflow as tf
  a = tf.constant([1.0, 2.0])
  b = tf.constant([3.0, 4.0])

  a_m = tf.constant([[1.0, 2.0]])
  b_m = tf.constant([[3.0], [4.0]])

  result_add = a + b
  result_multpl = tf.matmul(a_m, b_m)

  with tf.Session() as sess:
      print (sess.run(result_add))
      print (sess.run(result_multpl))

  print (result_add)
  print (result_multpl)
#+END_SRC


*** multiply

#+BEGIN_SRC python   :results output :session

  import tensorflow as tf
  #创建常量
  m1= tf.constant([[3,3]])
  m2=tf.constant([[1],[2]])
  #相乘
  product = tf.matmul(m1,m2)
  print(product)

  #定义一个会话，启动默认图
  sess = tf.Session()
  #调用sess，执行乘法运算
  result = sess.run(product)
  print(result)
  #不要忘了关闭sess
  sess.close()

  with tf.Session() as sess:
      result = sess.run(product)
      print(result)
  #使用with不需要专门关闭sess


#+END_SRC

#+RESULTS:
: Tensor("MatMul:0", shape=(1, 1), dtype=int32)
: [[9]]
: [[9]]

** Variable
*** the first using of variable & subtract add 
#+BEGIN_SRC python :results output
  import tensorflow as tf
  x = tf.Variable([1,2])
  a = tf.constant([3,3])
  sub = tf.subtract(x,a)
  add = tf.add(x,sub)
# 对于变量，要初始化init
  init = tf.global_variables_initializer()
  with tf.Session() as sess:
      sess.run(init)
      print(sess.run(sub))
      print(sess.run(add))


#+END_SRC

#+RESULTS:
: [-2 -1]
: [-1  1]

*** assign a value for variable and update & assign 
#+BEGIN_SRC python :results output
  #............................．．．．．．变量计算
  #变量可以被起名，初始化为０
  import tensorflow as tf
  state = tf.Variable(0, name = 'counter')
  new_value = tf.add(state,1)
  #赋值功能assign
  update = tf.assign(state,new_value)
  init = tf.global_variables_initializer()
  with tf.Session() as sess:
      sess.run(init)
      print(state)
      for _ in range(5):
          sess.run(update)
          print(sess.run(state))
          print(sess.run(update))


#+END_SRC

#+RESULTS:
#+begin_example
<tf.Variable 'counter:0' shape=() dtype=int32_ref>
1
2
3
4
5
6
7
8
9
10
#+end_example

