tf1.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-05-23 Sa 12:00 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>tf1</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="sx" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">tf1</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org254f344">Tensorflow</a>
<ul>
<li><a href="#org2b1d657">Constand additional und multiply</a>
<ul>
<li><a href="#org6fccd19">addition</a></li>
<li><a href="#org2c3480a">multiply</a></li>
</ul>
</li>
<li><a href="#org9aec7b1">Variable</a>
<ul>
<li><a href="#org02e9117">the first using of variable &amp; subtract add</a></li>
<li><a href="#orgb299d30">assign a value for variable and update &amp; assign</a></li>
<li><a href="#org3652c47">fetch and Feed &amp;placeholder</a></li>
</ul>
</li>
<li><a href="#orgff7a89b">Tuning</a>
<ul>
<li><a href="#org5b99ae5">change learing rate</a></li>
<li><a href="#org21033a1">learing rate for loss</a></li>
</ul>
</li>
<li><a href="#orgf20f9ce">train examples</a>
<ul>
<li><a href="#org0b9e66d">the first train case</a></li>
<li><a href="#orgf16303f">non linear regression case</a></li>
<li><a href="#orgbcb708a">the first train with data for accuary</a></li>
<li><a href="#org4b61725">a simple CNN case</a></li>
<li><a href="#orge0972bc">CNN train</a></li>
<li><a href="#org0ae002d">classification</a></li>
<li><a href="#orgee472ed">optimizer varialbe (with error)</a></li>
<li><a href="#orgd5428f5">dropout</a></li>
<li><a href="#org12aed59">number identification</a></li>
<li><a href="#orgd4abd3c">with L　regularizer</a></li>
<li><a href="#org5c5674c">without L regularizer</a></li>
<li><a href="#orgbdb3068">exponen decay with L regularizer(this has error)</a></li>
<li><a href="#org82981ca">read date for variables</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org1061e3d">keras</a>
<ul>
<li>
<ul>
<li><a href="#org6231cca">classification</a></li>
<li><a href="#org249ba7b">regression</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org8496276">sklearn</a>
<ul>
<li>
<ul>
<li><a href="#orgf0a0fc8">decisiontree</a></li>
<li><a href="#org0e51e60">cross validation 1</a></li>
<li><a href="#org9b03926">cross validation 2</a></li>
<li><a href="#org5fe5278">corss validation 3</a></li>
<li><a href="#orge67b345">data application</a></li>
<li><a href="#orgd80d682">eigenschaft function</a></li>
<li><a href="#orge1f17b0">iris</a></li>
<li><a href="#org6be5985">normnalization</a></li>
<li><a href="#orgf700e77">save load</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org9c62a5e">theano</a>
<ul>
<li>
<ul>
<li><a href="#orgdac2a39">basic</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgad42593">Backlinks</a></li>
<li><a href="#org901d760">1 Backlinks</a>
<ul>
<li><a href="#org9b1896a">AI</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org254f344" class="outline-2">
<h2 id="org254f344">Tensorflow</h2>
<div class="outline-text-2" id="text-org254f344">
</div>
<div id="outline-container-org2b1d657" class="outline-3">
<h3 id="org2b1d657">Constand additional und multiply</h3>
<div class="outline-text-3" id="text-org2b1d657">
</div>
<div id="outline-container-org6fccd19" class="outline-4">
<h4 id="org6fccd19">addition</h4>
<div class="outline-text-4" id="text-org6fccd19">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">import</span> tensorflow <span style="color: #4f97d7; font-weight: bold;">as</span> tf
<span style="color: #7590db;">a</span> = tf.constant([1.0, 2.0])
<span style="color: #7590db;">b</span> = tf.constant([3.0, 4.0])

<span style="color: #7590db;">a_m</span> = tf.constant([[1.0, 2.0]])
<span style="color: #7590db;">b_m</span> = tf.constant([[3.0], [4.0]])

<span style="color: #7590db;">result_add</span> = a + b
<span style="color: #7590db;">result_multpl</span> = tf.matmul(a_m, b_m)

<span style="color: #4f97d7; font-weight: bold;">with</span> tf.Session() <span style="color: #4f97d7; font-weight: bold;">as</span> sess:
    <span style="color: #4f97d7; font-weight: bold;">print</span> (sess.run(result_add))
    <span style="color: #4f97d7; font-weight: bold;">print</span> (sess.run(result_multpl))

<span style="color: #4f97d7; font-weight: bold;">print</span> (result_add)
<span style="color: #4f97d7; font-weight: bold;">print</span> (result_multpl)
</pre>
</div>
</div>
</div>


<div id="outline-container-org2c3480a" class="outline-4">
<h4 id="org2c3480a">multiply</h4>
<div class="outline-text-4" id="text-org2c3480a">
<div class="org-src-container">
<pre class="src src-python">
<span style="color: #4f97d7; font-weight: bold;">import</span> tensorflow <span style="color: #4f97d7; font-weight: bold;">as</span> tf
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&#21019;&#24314;&#24120;&#37327;</span>
<span style="color: #7590db;">m1</span>= tf.constant([[3,3]])
<span style="color: #7590db;">m2</span>=tf.constant([[1],[2]])
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&#30456;&#20056;</span>
<span style="color: #7590db;">product</span> = tf.matmul(m1,m2)
<span style="color: #4f97d7; font-weight: bold;">print</span>(product)

<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&#23450;&#20041;&#19968;&#20010;&#20250;&#35805;&#65292;&#21551;&#21160;&#40664;&#35748;&#22270;</span>
<span style="color: #7590db;">sess</span> = tf.Session()
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&#35843;&#29992;sess&#65292;&#25191;&#34892;&#20056;&#27861;&#36816;&#31639;</span>
<span style="color: #7590db;">result</span> = sess.run(product)
<span style="color: #4f97d7; font-weight: bold;">print</span>(result)
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&#19981;&#35201;&#24536;&#20102;&#20851;&#38381;sess</span>
sess.close()

<span style="color: #4f97d7; font-weight: bold;">with</span> tf.Session() <span style="color: #4f97d7; font-weight: bold;">as</span> sess:
    <span style="color: #7590db;">result</span> = sess.run(product)
    <span style="color: #4f97d7; font-weight: bold;">print</span>(result)
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&#20351;&#29992;with&#19981;&#38656;&#35201;&#19987;&#38376;&#20851;&#38381;sess</span>


</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org9aec7b1" class="outline-3">
<h3 id="org9aec7b1">Variable</h3>
<div class="outline-text-3" id="text-org9aec7b1">
</div>
<div id="outline-container-org02e9117" class="outline-4">
<h4 id="org02e9117">the first using of variable &amp; subtract add</h4>
<div class="outline-text-4" id="text-org02e9117">
<div class="org-src-container">
<pre class="src src-python">  <span style="color: #4f97d7; font-weight: bold;">import</span> tensorflow <span style="color: #4f97d7; font-weight: bold;">as</span> tf
  <span style="color: #7590db;">x</span> = tf.Variable([1,2])
  <span style="color: #7590db;">a</span> = tf.constant([3,3])
  <span style="color: #7590db;">sub</span> = tf.subtract(x,a)
  <span style="color: #7590db;">add</span> = tf.add(x,sub)
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#23545;&#20110;&#21464;&#37327;&#65292;&#35201;&#21021;&#22987;&#21270;init</span>
  <span style="color: #7590db;">init</span> = tf.global_variables_initializer()
  <span style="color: #4f97d7; font-weight: bold;">with</span> tf.Session() <span style="color: #4f97d7; font-weight: bold;">as</span> sess:
      sess.run(init)
      <span style="color: #4f97d7; font-weight: bold;">print</span>(sess.run(sub))
      <span style="color: #4f97d7; font-weight: bold;">print</span>(sess.run(add))


</pre>
</div>
</div>
</div>

<div id="outline-container-orgb299d30" class="outline-4">
<h4 id="orgb299d30">assign a value for variable and update &amp; assign</h4>
<div class="outline-text-4" id="text-orgb299d30">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">............................&#65294;&#65294;&#65294;&#65294;&#65294;&#65294;&#21464;&#37327;&#35745;&#31639;</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&#21464;&#37327;&#21487;&#20197;&#34987;&#36215;&#21517;&#65292;&#21021;&#22987;&#21270;&#20026;&#65296;</span>
<span style="color: #4f97d7; font-weight: bold;">import</span> tensorflow <span style="color: #4f97d7; font-weight: bold;">as</span> tf
<span style="color: #7590db;">state</span> = tf.Variable(0, name = <span style="color: #2d9574;">'counter'</span>)
<span style="color: #7590db;">new_value</span> = tf.add(state,1)
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&#36171;&#20540;&#21151;&#33021;assign</span>
<span style="color: #7590db;">update</span> = tf.assign(state,new_value)
<span style="color: #7590db;">init</span> = tf.global_variables_initializer()
<span style="color: #4f97d7; font-weight: bold;">with</span> tf.Session() <span style="color: #4f97d7; font-weight: bold;">as</span> sess:
    sess.run(init)
    <span style="color: #4f97d7; font-weight: bold;">print</span>(state)
    <span style="color: #4f97d7; font-weight: bold;">for</span> _ <span style="color: #4f97d7; font-weight: bold;">in</span> <span style="color: #4f97d7;">range</span>(5):
        sess.run(update)
        <span style="color: #4f97d7; font-weight: bold;">print</span>(sess.run(state))
        <span style="color: #4f97d7; font-weight: bold;">print</span>(sess.run(update))


</pre>
</div>
</div>
</div>
