tf1.org
*** fetch and Feed &placeholder
#+BEGIN_SRC python :results output
  import tensorflow as tf
  # Fetch 在一个会话里执行多个op
  input1 = tf.constant(3.0)
  input2 = tf.constant(2.0)
  input3 = tf.constant(5.0)

  add = tf.add(input2,input3)
  mul = tf.multiply(input1,add)

  with tf.Session() as sess:
      result = sess.run([add,mul])  #有[]
      print(result)

  #------------------Feed
  #创建占位符
  input4= tf.placeholder(tf.float32)
  input5 = tf.placeholder(tf.float32)
  output = tf.multiply(input4, input5)
  with tf.Session() as sess:
      print(sess.run(output,feed_dict = {input4:[7.0],input5:[2.0]}))  #随后赋值是用字典的方式进行的feed_dict = {input4:[7.0],input5:[2.0]}, 数字还加了方括号．


#+END_SRC

#+RESULTS:
: [7.0, 21.0]
: [14.]

** Tuning
*** change learing rate
#+BEGIN_SRC python
  #coding:utf-8

  import tensorflow as tf
  LEARING_RATE_BASE = 0.1
  LEARING_RATE_DECAY = 0.99
  LEARING_RATE_STEP= 1

  global_step = tf.Variable(0,trainable = False)
  learning_rate = tf.train.exponential_decay(LEARING_RATE_BASE, global_step,
  LEARING_RATE_STEP, LEARING_RATE_DECAY, staircase = True)
  
  w = tf.Variable(tf.constant(5, dtype = tf.float32))
  loss = tf.square(w+1)

  train_step = tf.train.GradientDescentOptimizer(learning_rate).minimize(loss,global_step = global_step)

  with tf.Session() as sess:
      init_op = tf.global_variables_initializer()
      sess.run(init_op)
      for i in range(40):
          sess.run(train_step)
          learnin_rate_val = sess.run(learning_rate)
          global_step_val = sess.run(global_step)
          w_val = sess.run(w)
          loss_val = sess.run(loss)
          print(" After {} steps: global_step is {}, w is {}, learnin_rate is {}, loss is {}"
  .format(i, global_step_val, w_val, learnin_rate_val, loss_val))


#+END_SRC
*** learing rate for loss
#+BEGIN_SRC python :results output
  import tensorflow as tf
  w = tf.Variable(tf.constant(5,dtype=tf.float32))
  loss = tf.square(w+1)
  train_step = tf.train.GradientDescentOptimizer(0.2).minimize(loss)

  with tf.Session() as sess:
      init_op=tf.global_variables_initializer()
      sess.run(init_op)
      for i in range(50):
          sess.run(train_step)
          w_var = sess.run(w)
          loss_val = sess.run(loss)
          print("After {} steps: w is {}, loss is {}".format(i,w_var,loss_val))
          #print("After %s steps: w is %f, loss is %f." %(i,w_var, loss_val))


#+END_SRC

** train examples
*** the first train case
#+BEGIN_SRC python :results output
  import tensorflow as tf
  import numpy as np
  import matplotlib.pyplot as plt
  #生成随机数据
  x_date = np.random.rand(100)
  y_date = x_date*0.4 + 2

  #构造线性模型
  b = tf.Variable(0.)
  k = tf.Variable(0.)
  y = k*x_date + b

  #构造二次代价函数
  loss = tf.reduce_mean(tf.square(y_date-y))
  #定义梯度下降的优化器
  optimizer = tf.train.GradientDescentOptimizer(0.2)
  #定义一个最小化代价函数
  train = optimizer.minimize(loss)
  init = tf.global_variables_initializer()
  with tf.Session() as sess:
      sess.run(init)
      for steps in range(201):
          sess.run(train)
          if steps%20 == 0:
              print(steps, sess.run([k,b]))
      prediction_value = sess.run(y)
      plt.figure()
      plt.scatter(x_date, y_date)
      plt.plot(x_date,prediction_value,'r-',lw=5)
      plt.show()



#+END_SRC

#+RESULTS:
#+begin_example
0 [0.44114023, 0.87820524]
20 [0.7041128, 1.841991]
40 [0.58822596, 1.9022033]
60 [0.5164994, 1.9394703]
80 [0.47210538, 1.9625362]
100 [0.44462854, 1.9768122]
120 [0.4276222, 1.9856484]
140 [0.4170963, 1.9911172]
160 [0.41058153, 1.9945022]
180 [0.40654916, 1.9965973]
200 [0.40405348, 1.9978939]
#+end_example

