tf1.html

<div id="outline-container-org3652c47" class="outline-4">
<h4 id="org3652c47">fetch and Feed &amp;placeholder</h4>
<div class="outline-text-4" id="text-org3652c47">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">import</span> tensorflow <span style="color: #4f97d7; font-weight: bold;">as</span> tf
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Fetch &#22312;&#19968;&#20010;&#20250;&#35805;&#37324;&#25191;&#34892;&#22810;&#20010;op</span>
<span style="color: #7590db;">input1</span> = tf.constant(3.0)
<span style="color: #7590db;">input2</span> = tf.constant(2.0)
<span style="color: #7590db;">input3</span> = tf.constant(5.0)

<span style="color: #7590db;">add</span> = tf.add(input2,input3)
<span style="color: #7590db;">mul</span> = tf.multiply(input1,add)

<span style="color: #4f97d7; font-weight: bold;">with</span> tf.Session() <span style="color: #4f97d7; font-weight: bold;">as</span> sess:
    <span style="color: #7590db;">result</span> = sess.run([add,mul])  <span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&#26377;[]</span>
    <span style="color: #4f97d7; font-weight: bold;">print</span>(result)

<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">------------------Feed</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&#21019;&#24314;&#21344;&#20301;&#31526;</span>
<span style="color: #7590db;">input4</span>= tf.placeholder(tf.float32)
<span style="color: #7590db;">input5</span> = tf.placeholder(tf.float32)
<span style="color: #7590db;">output</span> = tf.multiply(input4, input5)
<span style="color: #4f97d7; font-weight: bold;">with</span> tf.Session() <span style="color: #4f97d7; font-weight: bold;">as</span> sess:
    <span style="color: #4f97d7; font-weight: bold;">print</span>(sess.run(output,feed_dict = {input4:[7.0],input5:[2.0]}))  <span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&#38543;&#21518;&#36171;&#20540;&#26159;&#29992;&#23383;&#20856;&#30340;&#26041;&#24335;&#36827;&#34892;&#30340;feed_dict = {input4:[7.0],input5:[2.0]}, &#25968;&#23383;&#36824;&#21152;&#20102;&#26041;&#25324;&#21495;&#65294;</span>


</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgff7a89b" class="outline-3">
<h3 id="orgff7a89b">Tuning</h3>
<div class="outline-text-3" id="text-orgff7a89b">
</div>
<div id="outline-container-org5b99ae5" class="outline-4">
<h4 id="org5b99ae5">change learing rate</h4>
<div class="outline-text-4" id="text-org5b99ae5">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">coding:utf-8</span>

<span style="color: #4f97d7; font-weight: bold;">import</span> tensorflow <span style="color: #4f97d7; font-weight: bold;">as</span> tf
<span style="color: #7590db;">LEARING_RATE_BASE</span> = 0.1
<span style="color: #7590db;">LEARING_RATE_DECAY</span> = 0.99
<span style="color: #7590db;">LEARING_RATE_STEP</span>= 1

<span style="color: #7590db;">global_step</span> = tf.Variable(0,trainable = <span style="color: #a45bad;">False</span>)
<span style="color: #7590db;">learning_rate</span> = tf.train.exponential_decay(LEARING_RATE_BASE, global_step,
LEARING_RATE_STEP, LEARING_RATE_DECAY, staircase = <span style="color: #a45bad;">True</span>)

<span style="color: #7590db;">w</span> = tf.Variable(tf.constant(5, dtype = tf.float32))
<span style="color: #7590db;">loss</span> = tf.square(w+1)

<span style="color: #7590db;">train_step</span> = tf.train.GradientDescentOptimizer(learning_rate).minimize(loss,global_step = global_step)

<span style="color: #4f97d7; font-weight: bold;">with</span> tf.Session() <span style="color: #4f97d7; font-weight: bold;">as</span> sess:
    <span style="color: #7590db;">init_op</span> = tf.global_variables_initializer()
    sess.run(init_op)
    <span style="color: #4f97d7; font-weight: bold;">for</span> i <span style="color: #4f97d7; font-weight: bold;">in</span> <span style="color: #4f97d7;">range</span>(40):
        sess.run(train_step)
        <span style="color: #7590db;">learnin_rate_val</span> = sess.run(learning_rate)
        <span style="color: #7590db;">global_step_val</span> = sess.run(global_step)
        <span style="color: #7590db;">w_val</span> = sess.run(w)
        <span style="color: #7590db;">loss_val</span> = sess.run(loss)
        <span style="color: #4f97d7; font-weight: bold;">print</span>(<span style="color: #2d9574;">" After {} steps: global_step is {}, w is {}, learnin_rate is {}, loss is {}"</span>
.<span style="color: #4f97d7;">format</span>(i, global_step_val, w_val, learnin_rate_val, loss_val))


</pre>
</div>
</div>
</div>
<div id="outline-container-org21033a1" class="outline-4">
<h4 id="org21033a1">learing rate for loss</h4>
<div class="outline-text-4" id="text-org21033a1">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">import</span> tensorflow <span style="color: #4f97d7; font-weight: bold;">as</span> tf
<span style="color: #7590db;">w</span> = tf.Variable(tf.constant(5,dtype=tf.float32))
<span style="color: #7590db;">loss</span> = tf.square(w+1)
<span style="color: #7590db;">train_step</span> = tf.train.GradientDescentOptimizer(0.2).minimize(loss)

<span style="color: #4f97d7; font-weight: bold;">with</span> tf.Session() <span style="color: #4f97d7; font-weight: bold;">as</span> sess:
    <span style="color: #7590db;">init_op</span>=tf.global_variables_initializer()
    sess.run(init_op)
    <span style="color: #4f97d7; font-weight: bold;">for</span> i <span style="color: #4f97d7; font-weight: bold;">in</span> <span style="color: #4f97d7;">range</span>(50):
        sess.run(train_step)
        <span style="color: #7590db;">w_var</span> = sess.run(w)
        <span style="color: #7590db;">loss_val</span> = sess.run(loss)
        <span style="color: #4f97d7; font-weight: bold;">print</span>(<span style="color: #2d9574;">"After {} steps: w is {}, loss is {}"</span>.<span style="color: #4f97d7;">format</span>(i,w_var,loss_val))
        <span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">print("After %s steps: w is %f, loss is %f." %(i,w_var, loss_val))</span>


</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgf20f9ce" class="outline-3">
<h3 id="orgf20f9ce">train examples</h3>
<div class="outline-text-3" id="text-orgf20f9ce">
</div>
<div id="outline-container-org0b9e66d" class="outline-4">
<h4 id="org0b9e66d">the first train case</h4>
<div class="outline-text-4" id="text-org0b9e66d">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">import</span> tensorflow <span style="color: #4f97d7; font-weight: bold;">as</span> tf
<span style="color: #4f97d7; font-weight: bold;">import</span> numpy <span style="color: #4f97d7; font-weight: bold;">as</span> np
<span style="color: #4f97d7; font-weight: bold;">import</span> matplotlib.pyplot <span style="color: #4f97d7; font-weight: bold;">as</span> plt
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&#29983;&#25104;&#38543;&#26426;&#25968;&#25454;</span>
<span style="color: #7590db;">x_date</span> = np.random.rand(100)
<span style="color: #7590db;">y_date</span> = x_date*0.4 + 2

<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&#26500;&#36896;&#32447;&#24615;&#27169;&#22411;</span>
<span style="color: #7590db;">b</span> = tf.Variable(0.)
<span style="color: #7590db;">k</span> = tf.Variable(0.)
<span style="color: #7590db;">y</span> = k*x_date + b

<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&#26500;&#36896;&#20108;&#27425;&#20195;&#20215;&#20989;&#25968;</span>
<span style="color: #7590db;">loss</span> = tf.reduce_mean(tf.square(y_date-y))
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&#23450;&#20041;&#26799;&#24230;&#19979;&#38477;&#30340;&#20248;&#21270;&#22120;</span>
<span style="color: #7590db;">optimizer</span> = tf.train.GradientDescentOptimizer(0.2)
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&#23450;&#20041;&#19968;&#20010;&#26368;&#23567;&#21270;&#20195;&#20215;&#20989;&#25968;</span>
<span style="color: #7590db;">train</span> = optimizer.minimize(loss)
<span style="color: #7590db;">init</span> = tf.global_variables_initializer()
<span style="color: #4f97d7; font-weight: bold;">with</span> tf.Session() <span style="color: #4f97d7; font-weight: bold;">as</span> sess:
    sess.run(init)
    <span style="color: #4f97d7; font-weight: bold;">for</span> steps <span style="color: #4f97d7; font-weight: bold;">in</span> <span style="color: #4f97d7;">range</span>(201):
        sess.run(train)
        <span style="color: #4f97d7; font-weight: bold;">if</span> steps%20 == 0:
            <span style="color: #4f97d7; font-weight: bold;">print</span>(steps, sess.run([k,b]))
    <span style="color: #7590db;">prediction_value</span> = sess.run(y)
    plt.figure()
    plt.scatter(x_date, y_date)
    plt.plot(x_date,prediction_value,<span style="color: #2d9574;">'r-'</span>,lw=5)
    plt.show()



</pre>
</div>
</div>
</div>
