tf1.org
*** non linear regression case
#+BEGIN_SRC python
  #----------------------------非线性回归
  import tensorflow as tf
  import numpy as np
  import matplotlib.pyplot as plt

  #构造数据
  x_date = np.linspace (-0.5,0.5,100)[:,np.newaxis] #np.newaxis 功能同None，将行变列
  noise = np.random.normal(0,0.02,x_date.shape)
  y_date = np.square(x_date)+noise

  x = tf.placeholder(tf.float32,[None,1])
  y = tf.placeholder(tf.float32,[None,1])

  #构建神经网络
  Weight_L1 = tf.Variable(tf.random_normal([1,10]))
  Biase_L1 = tf.Variable(tf.zeros([1,10]))
  Wx_plus_b_L1 = tf.matmul(x,Weight_L1)+Biase_L1
  L1 = tf.nn.tanh(Wx_plus_b_L1)

  #定义输出层
  Weight_L2 = tf.Variable(tf.random_normal([10,1]))
  Biase_L2 = tf.Variable(tf.zeros([1,1]))
  Wx_plus_b_L2 = tf.matmul(L1,Weight_L2)+ Biase_L2
  prediction = tf.nn.tanh(Wx_plus_b_L2)

  #二次代价函数
  loss = tf.reduce_mean(tf.square(y-prediction))
  train_step = tf.train.GradientDescentOptimizer(0.1).minimize(loss)
  with tf.Session() as sess:
      sess.run(tf.global_variables_initializer())
      for _ in range(2000):
          sess.run(train_step,feed_dict={x:x_date,y:y_date})

      #训练好后，用来做预测
      prediction_value = sess.run(prediction,feed_dict={x:x_date})
      plt.figure()
      plt.scatter(x_date, y_date)
      plt.plot(x_date,prediction_value,'r-',lw=5)
      plt.show()


#+END_SRC

#+RESULTS:
: None

