tf1.html

<div id="outline-container-orgf16303f" class="outline-4">
<h4 id="orgf16303f">non linear regression case</h4>
<div class="outline-text-4" id="text-orgf16303f">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">----------------------------&#38750;&#32447;&#24615;&#22238;&#24402;</span>
<span style="color: #4f97d7; font-weight: bold;">import</span> tensorflow <span style="color: #4f97d7; font-weight: bold;">as</span> tf
<span style="color: #4f97d7; font-weight: bold;">import</span> numpy <span style="color: #4f97d7; font-weight: bold;">as</span> np
<span style="color: #4f97d7; font-weight: bold;">import</span> matplotlib.pyplot <span style="color: #4f97d7; font-weight: bold;">as</span> plt

<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&#26500;&#36896;&#25968;&#25454;</span>
<span style="color: #7590db;">x_date</span> = np.linspace (-0.5,0.5,100)[:,np.newaxis] <span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">np.newaxis &#21151;&#33021;&#21516;None&#65292;&#23558;&#34892;&#21464;&#21015;</span>
<span style="color: #7590db;">noise</span> = np.random.normal(0,0.02,x_date.shape)
<span style="color: #7590db;">y_date</span> = np.square(x_date)+noise

<span style="color: #7590db;">x</span> = tf.placeholder(tf.float32,[<span style="color: #a45bad;">None</span>,1])
<span style="color: #7590db;">y</span> = tf.placeholder(tf.float32,[<span style="color: #a45bad;">None</span>,1])

<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&#26500;&#24314;&#31070;&#32463;&#32593;&#32476;</span>
<span style="color: #7590db;">Weight_L1</span> = tf.Variable(tf.random_normal([1,10]))
<span style="color: #7590db;">Biase_L1</span> = tf.Variable(tf.zeros([1,10]))
<span style="color: #7590db;">Wx_plus_b_L1</span> = tf.matmul(x,Weight_L1)+Biase_L1
<span style="color: #7590db;">L1</span> = tf.nn.tanh(Wx_plus_b_L1)

<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&#23450;&#20041;&#36755;&#20986;&#23618;</span>
<span style="color: #7590db;">Weight_L2</span> = tf.Variable(tf.random_normal([10,1]))
<span style="color: #7590db;">Biase_L2</span> = tf.Variable(tf.zeros([1,1]))
<span style="color: #7590db;">Wx_plus_b_L2</span> = tf.matmul(L1,Weight_L2)+ Biase_L2
<span style="color: #7590db;">prediction</span> = tf.nn.tanh(Wx_plus_b_L2)

<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&#20108;&#27425;&#20195;&#20215;&#20989;&#25968;</span>
<span style="color: #7590db;">loss</span> = tf.reduce_mean(tf.square(y-prediction))
<span style="color: #7590db;">train_step</span> = tf.train.GradientDescentOptimizer(0.1).minimize(loss)
<span style="color: #4f97d7; font-weight: bold;">with</span> tf.Session() <span style="color: #4f97d7; font-weight: bold;">as</span> sess:
    sess.run(tf.global_variables_initializer())
    <span style="color: #4f97d7; font-weight: bold;">for</span> _ <span style="color: #4f97d7; font-weight: bold;">in</span> <span style="color: #4f97d7;">range</span>(2000):
        sess.run(train_step,feed_dict={x:x_date,y:y_date})

    <span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&#35757;&#32451;&#22909;&#21518;&#65292;&#29992;&#26469;&#20570;&#39044;&#27979;</span>
    <span style="color: #7590db;">prediction_value</span> = sess.run(prediction,feed_dict={x:x_date})
    plt.figure()
    plt.scatter(x_date, y_date)
    plt.plot(x_date,prediction_value,<span style="color: #2d9574;">'r-'</span>,lw=5)
    plt.show()


</pre>
</div>
</div>
</div>
