tf1.org
*** the first train with data for accuary
#+BEGIN_SRC python
  import tensorflow as tf
  from tensorflow.examples.tutorials.mnist import input_data
  #载入数据集
  mnist= input_data.read_data_sets('MNIST_data', one_hot = True)

  #设定每个批次的大小
  batch_size = 100
  #计算总共的批次
  n_batch = mnist.train.num_examples // batch_size

  #参数统计
  def variable_summries(var):
      with tf.name_scope('summaries'):
          mean = tf.reduce_mean(var)
          tf.summary.scalar('mean',mean)
          with tf.name_scope('stddev'):
              stddev = tf.sqrt(tf.reduce_mean(tf.square(var-mean)))
          tf.summary.scalar('stddev',stddev)
          tf.summary.scalar('max',tf.reduce_max(var))
          tf.summary.scalar('min',tf.reduce_min(var))
          tf.summary.histogram('histogram',var)

  #命名空间
  with tf.name_scope('input'):
      x = tf.placeholder(tf.float32,[None,784])
      y = tf.placeholder(tf.float32,[None,10])

  with tf.name_scope('layers'):
      with tf.name_scope('wight'):
          W = tf.Variable(tf.truncated_normal([784,10]))
          variable_summries(W)
      with tf.name_scope('biases'):
          B = tf.Variable(tf.zeros([10])+0.1)
          variable_summries(B)
      with tf.name_scope('wx_plus_b'):
          wx_plus_b=tf.matmul(x,W)+B
      with tf.name_scope('softmax'):    
          prediction = tf.nn.tanh(wx_plus_b)

  #定义二次代价函数
  #loss = tf.reduce_mean(tf.square(y-prediction))
  #重新定义对数(交叉熵)
  with tf.name_scope('loss'):
      loss =tf.reduce_mean(tf.nn.softmax_cross_entropy_with_logits(labels=y,logits=prediction))
      tf.summary.scalar('loss',loss)
  #使用梯度下降法

  with tf.name_scope('train'):
      train_step = tf.train.GradientDescentOptimizer(0.2).minimize(loss)
  #    train_step = tf.train.AdamOptimizer(0.05).minimize(loss)
  #初始化
  init = tf.global_variables_initializer()

  #测试准确率
  with tf.name_scope('accuracy'):
      with tf.name_scope('correct_prediction'):
          correct_prediction = tf.equal(tf.argmax(y,1), tf.argmax(prediction,1))
      with tf.name_scope('accuracy'):
          accuracy = tf.reduce_mean(tf.cast(correct_prediction,tf.float32))
          tf.summary.scalar('accuracy',accuracy)

  #合并summary
  merged = tf.summary.merge_all()
          #训练开始
  with tf.Session() as sess:
      writer = tf.summary.FileWriter('pics/',sess.graph)
      sess.run(init)
      for epoch in range(51):
          for batch in range(n_batch):
              batch_xs, batch_ys = mnist.train.next_batch(batch_size)
              summary,_ = sess.run([merged,train_step], feed_dict={x:batch_xs, y:batch_ys})
  #            writer.add_summary(summary,batch)
          writer.add_summary(summary,epoch)
          acc = sess.run(accuracy,feed_dict={x:mnist.test.images, y:mnist.test.labels})
          print("准确率为:　在"+str(epoch)+"回,"+str(acc))



#+END_SRC

#+RESULTS:
: None

