tf1.html

<div id="outline-container-orgbcb708a" class="outline-4">
<h4 id="orgbcb708a">the first train with data for accuary</h4>
<div class="outline-text-4" id="text-orgbcb708a">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">import</span> tensorflow <span style="color: #4f97d7; font-weight: bold;">as</span> tf
<span style="color: #4f97d7; font-weight: bold;">from</span> tensorflow.examples.tutorials.mnist <span style="color: #4f97d7; font-weight: bold;">import</span> input_data
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&#36733;&#20837;&#25968;&#25454;&#38598;</span>
<span style="color: #7590db;">mnist</span>= input_data.read_data_sets(<span style="color: #2d9574;">'MNIST_data'</span>, one_hot = <span style="color: #a45bad;">True</span>)

<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&#35774;&#23450;&#27599;&#20010;&#25209;&#27425;&#30340;&#22823;&#23567;</span>
<span style="color: #7590db;">batch_size</span> = 100
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&#35745;&#31639;&#24635;&#20849;&#30340;&#25209;&#27425;</span>
<span style="color: #7590db;">n_batch</span> = mnist.train.num_examples // batch_size

<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&#21442;&#25968;&#32479;&#35745;</span>
<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">variable_summries</span>(var):
    <span style="color: #4f97d7; font-weight: bold;">with</span> tf.name_scope(<span style="color: #2d9574;">'summaries'</span>):
        <span style="color: #7590db;">mean</span> = tf.reduce_mean(var)
        tf.summary.scalar(<span style="color: #2d9574;">'mean'</span>,mean)
        <span style="color: #4f97d7; font-weight: bold;">with</span> tf.name_scope(<span style="color: #2d9574;">'stddev'</span>):
            <span style="color: #7590db;">stddev</span> = tf.sqrt(tf.reduce_mean(tf.square(var-mean)))
        tf.summary.scalar(<span style="color: #2d9574;">'stddev'</span>,stddev)
        tf.summary.scalar(<span style="color: #2d9574;">'max'</span>,tf.reduce_max(var))
        tf.summary.scalar(<span style="color: #2d9574;">'min'</span>,tf.reduce_min(var))
        tf.summary.histogram(<span style="color: #2d9574;">'histogram'</span>,var)

<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&#21629;&#21517;&#31354;&#38388;</span>
<span style="color: #4f97d7; font-weight: bold;">with</span> tf.name_scope(<span style="color: #2d9574;">'input'</span>):
    <span style="color: #7590db;">x</span> = tf.placeholder(tf.float32,[<span style="color: #a45bad;">None</span>,784])
    <span style="color: #7590db;">y</span> = tf.placeholder(tf.float32,[<span style="color: #a45bad;">None</span>,10])

<span style="color: #4f97d7; font-weight: bold;">with</span> tf.name_scope(<span style="color: #2d9574;">'layers'</span>):
    <span style="color: #4f97d7; font-weight: bold;">with</span> tf.name_scope(<span style="color: #2d9574;">'wight'</span>):
        <span style="color: #7590db;">W</span> = tf.Variable(tf.truncated_normal([784,10]))
        variable_summries(W)
    <span style="color: #4f97d7; font-weight: bold;">with</span> tf.name_scope(<span style="color: #2d9574;">'biases'</span>):
        <span style="color: #7590db;">B</span> = tf.Variable(tf.zeros([10])+0.1)
        variable_summries(B)
    <span style="color: #4f97d7; font-weight: bold;">with</span> tf.name_scope(<span style="color: #2d9574;">'wx_plus_b'</span>):
        <span style="color: #7590db;">wx_plus_b</span>=tf.matmul(x,W)+B
    <span style="color: #4f97d7; font-weight: bold;">with</span> tf.name_scope(<span style="color: #2d9574;">'softmax'</span>):    
        <span style="color: #7590db;">prediction</span> = tf.nn.tanh(wx_plus_b)

<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&#23450;&#20041;&#20108;&#27425;&#20195;&#20215;&#20989;&#25968;</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">loss = tf.reduce_mean(tf.square(y-prediction))</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&#37325;&#26032;&#23450;&#20041;&#23545;&#25968;(&#20132;&#21449;&#29109;)</span>
<span style="color: #4f97d7; font-weight: bold;">with</span> tf.name_scope(<span style="color: #2d9574;">'loss'</span>):
    <span style="color: #7590db;">loss</span> =tf.reduce_mean(tf.nn.softmax_cross_entropy_with_logits(labels=y,logits=prediction))
    tf.summary.scalar(<span style="color: #2d9574;">'loss'</span>,loss)
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&#20351;&#29992;&#26799;&#24230;&#19979;&#38477;&#27861;</span>

<span style="color: #4f97d7; font-weight: bold;">with</span> tf.name_scope(<span style="color: #2d9574;">'train'</span>):
    <span style="color: #7590db;">train_step</span> = tf.train.GradientDescentOptimizer(0.2).minimize(loss)
<span style="color: #2aa1ae; background-color: #292e34;">#    </span><span style="color: #2aa1ae; background-color: #292e34;">train_step = tf.train.AdamOptimizer(0.05).minimize(loss)</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&#21021;&#22987;&#21270;</span>
<span style="color: #7590db;">init</span> = tf.global_variables_initializer()

<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&#27979;&#35797;&#20934;&#30830;&#29575;</span>
<span style="color: #4f97d7; font-weight: bold;">with</span> tf.name_scope(<span style="color: #2d9574;">'accuracy'</span>):
    <span style="color: #4f97d7; font-weight: bold;">with</span> tf.name_scope(<span style="color: #2d9574;">'correct_prediction'</span>):
        <span style="color: #7590db;">correct_prediction</span> = tf.equal(tf.argmax(y,1), tf.argmax(prediction,1))
    <span style="color: #4f97d7; font-weight: bold;">with</span> tf.name_scope(<span style="color: #2d9574;">'accuracy'</span>):
        <span style="color: #7590db;">accuracy</span> = tf.reduce_mean(tf.cast(correct_prediction,tf.float32))
        tf.summary.scalar(<span style="color: #2d9574;">'accuracy'</span>,accuracy)

<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&#21512;&#24182;summary</span>
<span style="color: #7590db;">merged</span> = tf.summary.merge_all()
        <span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&#35757;&#32451;&#24320;&#22987;</span>
<span style="color: #4f97d7; font-weight: bold;">with</span> tf.Session() <span style="color: #4f97d7; font-weight: bold;">as</span> sess:
    <span style="color: #7590db;">writer</span> = tf.summary.FileWriter(<span style="color: #2d9574;">'pics/'</span>,sess.graph)
    sess.run(init)
    <span style="color: #4f97d7; font-weight: bold;">for</span> epoch <span style="color: #4f97d7; font-weight: bold;">in</span> <span style="color: #4f97d7;">range</span>(51):
        <span style="color: #4f97d7; font-weight: bold;">for</span> batch <span style="color: #4f97d7; font-weight: bold;">in</span> <span style="color: #4f97d7;">range</span>(n_batch):
            <span style="color: #7590db;">batch_xs</span>, <span style="color: #7590db;">batch_ys</span> = mnist.train.next_batch(batch_size)
            <span style="color: #7590db;">summary</span>,<span style="color: #7590db;">_</span> = sess.run([merged,train_step], feed_dict={x:batch_xs, y:batch_ys})
<span style="color: #2aa1ae; background-color: #292e34;">#            </span><span style="color: #2aa1ae; background-color: #292e34;">writer.add_summary(summary,batch)</span>
        writer.add_summary(summary,epoch)
        <span style="color: #7590db;">acc</span> = sess.run(accuracy,feed_dict={x:mnist.test.images, y:mnist.test.labels})
        <span style="color: #4f97d7; font-weight: bold;">print</span>(<span style="color: #2d9574;">"&#20934;&#30830;&#29575;&#20026;:&#12288;&#22312;"</span>+<span style="color: #4f97d7;">str</span>(epoch)+<span style="color: #2d9574;">"&#22238;,"</span>+<span style="color: #4f97d7;">str</span>(acc))



</pre>
</div>
</div>
</div>
