tf1.org
*** a simple CNN case
#+BEGIN_SRC python  :results output
  import tensorflow as tf
  import numpy as np
  BATCH_SIZE = 8
  seed = 23455

  rng = np.random.RandomState(seed)
  X = rng.rand(32, 2)
  Y = [[int(X0+X1 < 1)] for (X0, X1) in X]
  # print ("X is :", X)
  # print ("Y is :", Y)

  x = tf.placeholder(tf.float32, shape = (None, 2))
  y_ = tf.placeholder(tf.float32, shape = (None, 1))

  w1 = tf.Variable(tf.random_normal([2,3], stddev=1, seed=1))
  w = tf.Variable(tf.random_normal([3,3], stddev=1, seed=1))
  w2 = tf.Variable(tf.random_normal([3,1], stddev=1, seed=1))

  a = tf.matmul(x,w1)
  b = tf.matmul(a,w)
  y = tf.matmul(b,w2)

  loss = tf.reduce_mean(tf.square(y-y_))
  train_step = tf.train.GradientDescentOptimizer(0.001).minimize(loss)

  with tf.Session() as sess:
      init_op = tf.global_variables_initializer()
      sess.run(init_op)
      print("w1 is :", sess.run(w1))
      print("w is :", sess.run(w))
      print("w2 is :", sess.run(w2))

      steps= 30000
      for i in range(steps):
          start = (i*BATCH_SIZE) % 32
          end = start + BATCH_SIZE
          sess.run(train_step, feed_dict={x:X[start:end], y_:Y[start:end]})
          if i % 5000 == 0:
              total_loss = sess.run(loss, feed_dict={x:X, y_:Y})
              print("After %d training steps, loss on all data is %g" %(i,total_loss))
      print("\n")
      print("w1 is :", sess.run(w1))
      print("w is :", sess.run(w))
      print("w2 is :", sess.run(w2))

#+END_SRC

#+RESULTS:
#+begin_example
w1 is : [[-0.8113182   1.4845988   0.06532937]
 [-2.4427042   0.0992484   0.5912243 ]]
w is : [[-0.8113182   1.4845988   0.06532937]
 [-2.4427042   0.0992484   0.5912243 ]
 [ 0.59282297 -2.1229296  -0.72289723]]
w2 is : [[-0.8113182 ]
 [ 1.4845988 ]
 [ 0.06532937]]
After 0 training steps, loss on all data is 27.0734
After 5000 training steps, loss on all data is 0.383562
After 10000 training steps, loss on all data is 0.383562
After 15000 training steps, loss on all data is 0.383562
After 20000 training steps, loss on all data is 0.383562
After 25000 training steps, loss on all data is 0.383561


w1 is : [[-0.84913164  1.3203508   0.219825  ]
 [-1.9427874   0.7993799  -0.2589098 ]]
w is : [[-0.31725118  0.802253    0.02743915]
 [-2.471998    0.16294315  0.5947651 ]
 [ 0.56031865 -2.0743563  -0.7197714 ]]
w2 is : [[-0.45712712]
 [ 0.67528236]
 [ 0.02388799]]
#+end_example

