tf1.html
<div id="outline-container-orgee472ed" class="outline-4">
<h4 id="orgee472ed">optimizer varialbe (with error)</h4>
<div class="outline-text-4" id="text-orgee472ed">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">View more python learning tutorial on my Youtube and Youku channel!!!</span>

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Youtube video tutorial: https://www.youtube.com/channel/UCdyjiB5H8Pu7aDTNVXTTpcg</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Youku video tutorial: http://i.youku.com/pythontutorial</span>

<span style="color: #9f8766;">"""</span>
<span style="color: #9f8766;">Please note, this code is only for python 3+. If you are using python 2+, please modify the code accordingly.</span>
<span style="color: #9f8766;">"""</span>
<span style="color: #4f97d7; font-weight: bold;">from</span> __future__ <span style="color: #4f97d7; font-weight: bold;">import</span> print_function
<span style="color: #4f97d7; font-weight: bold;">import</span> tensorflow <span style="color: #4f97d7; font-weight: bold;">as</span> tf
<span style="color: #4f97d7; font-weight: bold;">import</span> numpy <span style="color: #4f97d7; font-weight: bold;">as</span> np


<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">add_layer</span>(inputs, in_size, out_size, n_layer, activation_function=<span style="color: #a45bad;">None</span>):
    <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">add one more layer and return the output of this layer</span>
    <span style="color: #7590db;">layer_name</span> = <span style="color: #2d9574;">'layer%s'</span> % n_layer
    <span style="color: #4f97d7; font-weight: bold;">with</span> tf.name_scope(layer_name):
        <span style="color: #4f97d7; font-weight: bold;">with</span> tf.name_scope(<span style="color: #2d9574;">'weights'</span>):
            <span style="color: #7590db;">Weights</span> = tf.Variable(tf.random_normal([in_size, out_size]), name=<span style="color: #2d9574;">'W'</span>)
            tf.summary.histogram(layer_name + <span style="color: #2d9574;">'/weights'</span>, Weights)
        <span style="color: #4f97d7; font-weight: bold;">with</span> tf.name_scope(<span style="color: #2d9574;">'biases'</span>):
            <span style="color: #7590db;">biases</span> = tf.Variable(tf.zeros([1, out_size]) + 0.1, name=<span style="color: #2d9574;">'b'</span>)
            tf.summary.histogram(layer_name + <span style="color: #2d9574;">'/biases'</span>, biases)
        <span style="color: #4f97d7; font-weight: bold;">with</span> tf.name_scope(<span style="color: #2d9574;">'Wx_plus_b'</span>):
            <span style="color: #7590db;">Wx_plus_b</span> = tf.add(tf.matmul(inputs, Weights), biases)
        <span style="color: #4f97d7; font-weight: bold;">if</span> activation_function <span style="color: #4f97d7; font-weight: bold;">is</span> <span style="color: #a45bad;">None</span>:
            <span style="color: #7590db;">outputs</span> = Wx_plus_b
        <span style="color: #4f97d7; font-weight: bold;">else</span>:
            <span style="color: #7590db;">outputs</span> = activation_function(Wx_plus_b, )
        tf.summary.histogram(layer_name + <span style="color: #2d9574;">'/outputs'</span>, outputs)
    <span style="color: #4f97d7; font-weight: bold;">return</span> outputs


<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Make up some real data</span>
<span style="color: #7590db;">x_data</span> = np.linspace(-1, 1, 300)[:, np.newaxis]
<span style="color: #7590db;">noise</span> = np.random.normal(0, 0.05, x_data.shape)
<span style="color: #7590db;">y_data</span> = np.square(x_data) - 0.5 + noise

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">define placeholder for inputs to network</span>
<span style="color: #4f97d7; font-weight: bold;">with</span> tf.name_scope(<span style="color: #2d9574;">'inputs'</span>):
    <span style="color: #7590db;">xs</span> = tf.placeholder(tf.float32, [<span style="color: #a45bad;">None</span>, 1], name=<span style="color: #2d9574;">'x_input'</span>)
    <span style="color: #7590db;">ys</span> = tf.placeholder(tf.float32, [<span style="color: #a45bad;">None</span>, 1], name=<span style="color: #2d9574;">'y_input'</span>)

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">add hidden layer</span>
<span style="color: #7590db;">l1</span> = add_layer(xs, 1, 10, n_layer=1, activation_function=tf.nn.relu)
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">add output layer</span>
<span style="color: #7590db;">prediction</span> = add_layer(l1, 10, 1, n_layer=2, activation_function=<span style="color: #a45bad;">None</span>)

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">the error between prediciton and real data</span>
<span style="color: #4f97d7; font-weight: bold;">with</span> tf.name_scope(<span style="color: #2d9574;">'loss'</span>):
    <span style="color: #7590db;">loss</span> = tf.reduce_mean(tf.reduce_sum(tf.square(ys - prediction),
                                        reduction_indices=[1]))
    tf.summary.scalar(<span style="color: #2d9574;">'loss'</span>, loss)

<span style="color: #4f97d7; font-weight: bold;">with</span> tf.name_scope(<span style="color: #2d9574;">'train'</span>):
    <span style="color: #7590db;">train_step</span> = tf.train.GradientDescentOptimizer(0.1).minimize(loss)

<span style="color: #7590db;">sess</span> = tf.Session()
<span style="color: #7590db;">merged</span> = tf.summary.merge_all()

<span style="color: #7590db;">writer</span> = tf.summary.FileWriter(<span style="color: #2d9574;">"logs/"</span>, sess.graph)

<span style="color: #7590db;">init</span> = tf.global_variables_initializer()
sess.run(init)

<span style="color: #4f97d7; font-weight: bold;">for</span> i <span style="color: #4f97d7; font-weight: bold;">in</span> <span style="color: #4f97d7;">range</span>(1000):
    sess.run(train_step, feed_dict={xs: x_data, ys: y_data})
    <span style="color: #4f97d7; font-weight: bold;">if</span> i % 50 == 0:
        <span style="color: #7590db;">result</span> = sess.run(merged,
                          feed_dict={xs: x_data, ys: y_data})
        writer.add_summary(result, i)

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">direct to the local dir and run this in terminal:</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">$ tensorboard --logdir logs</span>


</pre>
</div>
</div>
</div>
