tf1.html
<div id="outline-container-org12aed59" class="outline-4">
<h4 id="org12aed59">number identification</h4>
<div class="outline-text-4" id="text-org12aed59">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">import</span> tensorflow <span style="color: #4f97d7; font-weight: bold;">as</span> tf
<span style="color: #4f97d7; font-weight: bold;">from</span> tensorflow.examples.tutorials.mnist <span style="color: #4f97d7; font-weight: bold;">import</span> input_data
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&#36733;&#20837;&#25968;&#25454;&#38598;</span>
<span style="color: #7590db;">mnist</span>= input_data.read_data_sets(<span style="color: #2d9574;">'MNIST_data'</span>, one_hot = <span style="color: #a45bad;">True</span>)

<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&#35774;&#23450;&#27599;&#20010;&#25209;&#27425;&#30340;&#22823;&#23567;</span>
<span style="color: #7590db;">batch_size</span> = 100
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&#35745;&#31639;&#24635;&#20849;&#30340;&#25209;&#27425;</span>
<span style="color: #7590db;">n_batch</span> = mnist.train.num_examples // batch_size

<span style="color: #7590db;">x</span> = tf.placeholder(tf.float32,[<span style="color: #a45bad;">None</span>,784])
<span style="color: #7590db;">y</span> = tf.placeholder(tf.float32,[<span style="color: #a45bad;">None</span>,10])
<span style="color: #7590db;">keep_prob</span> = tf.placeholder(tf.float32)
<span style="color: #7590db;">lr</span>= tf.Variable(0.001,dtype=tf.float32)
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&#26500;&#24314;&#31070;&#32463;&#32593;&#32476;</span>

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">W = tf.Variable(tf.truncated_normal([784,10]))</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">B = tf.Variable(tf.zeros([10])+0.1)</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">prediction = tf.nn.softmax(tf.matmul(x,W)+B)</span>

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">W = tf.Variable(tf.zeros([784,10]))</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">B = tf.Variable(tf.zeros([10]))</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">prediction = tf.nn.softmax(tf.matmul(x,W)+B)</span>

<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&#26500;&#24314;&#31070;&#32463;&#32593;&#32476;</span>
<span style="color: #7590db;">W</span> = tf.Variable(tf.truncated_normal([784,500],stddev =0.1))
<span style="color: #7590db;">B</span> = tf.Variable(tf.zeros([500])+0.1)
<span style="color: #7590db;">p1</span> = tf.nn.tanh(tf.matmul(x,W)+B)
<span style="color: #7590db;">p1_dropout</span> = tf.nn.dropout(p1,keep_prob)

<span style="color: #7590db;">W1</span> = tf.Variable(tf.truncated_normal([500,200],stddev=0.1))
<span style="color: #7590db;">B1</span> = tf.Variable(tf.zeros([200])+0.1)
<span style="color: #7590db;">p2</span> = tf.nn.tanh(tf.matmul(p1_dropout,W1)+B1)
<span style="color: #7590db;">p2_dropout</span> = tf.nn.dropout(p2,keep_prob)

<span style="color: #7590db;">W2</span> = tf.Variable(tf.truncated_normal([200,10],stddev = 0.1))
<span style="color: #7590db;">B2</span> = tf.Variable(tf.zeros([10])+0.1)
<span style="color: #7590db;">prediction</span> = tf.nn.softmax(tf.matmul(p2_dropout,W2)+B2)



<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&#23450;&#20041;&#20108;&#27425;&#20195;&#20215;&#20989;&#25968;</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">loss = tf.reduce_mean(tf.square(y-prediction))</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&#37325;&#26032;&#23450;&#20041;&#23545;&#25968;(&#20132;&#21449;&#29109;)</span>
<span style="color: #7590db;">loss</span> =tf.reduce_mean(tf.nn.softmax_cross_entropy_with_logits(labels=y,logits=prediction))
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&#20351;&#29992;&#26799;&#24230;&#19979;&#38477;&#27861;</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">train_step = tf.train.GradientDescentOptimizer(0.2).minimize(loss)</span>
<span style="color: #7590db;">train_step</span> = tf.train.AdamOptimizer(lr).minimize(loss)
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&#21021;&#22987;&#21270;</span>
<span style="color: #7590db;">init</span> = tf.global_variables_initializer()

<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&#27979;&#35797;&#20934;&#30830;&#29575;</span>
<span style="color: #7590db;">correct_prediction</span> = tf.equal(tf.argmax(y,1), tf.argmax(prediction,1))
<span style="color: #7590db;">accuracy</span> = tf.reduce_mean(tf.cast(correct_prediction,tf.float32))

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">#&#35757;&#32451;&#24320;&#22987;</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">with tf.Session() as sess:</span>
<span style="color: #2aa1ae; background-color: #292e34;">#     </span><span style="color: #2aa1ae; background-color: #292e34;">sess.run(init)</span>
<span style="color: #2aa1ae; background-color: #292e34;">#     </span><span style="color: #2aa1ae; background-color: #292e34;">for epoch in range(20):</span>
<span style="color: #2aa1ae; background-color: #292e34;">#         </span><span style="color: #2aa1ae; background-color: #292e34;">for batch in range(n_batch):</span>
<span style="color: #2aa1ae; background-color: #292e34;">#             </span><span style="color: #2aa1ae; background-color: #292e34;">batch_xs, batch_ys = mnist.train.next_batch(batch_size)</span>
<span style="color: #2aa1ae; background-color: #292e34;">#             </span><span style="color: #2aa1ae; background-color: #292e34;">sess.run(train_step, feed_dict={x:batch_xs, y:batch_ys})</span>
<span style="color: #2aa1ae; background-color: #292e34;">#         </span><span style="color: #2aa1ae; background-color: #292e34;">acc = sess.run(accuracy,feed_dict={x:mnist.test.images, y:mnist.test.labels})</span>
<span style="color: #2aa1ae; background-color: #292e34;">#         </span><span style="color: #2aa1ae; background-color: #292e34;">print("&#20934;&#30830;&#29575;&#20026;:&#12288;&#22312;"+str(epoch)+"&#22238;,"+str(acc))</span>


<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&#35757;&#32451;&#24320;&#22987;</span>
<span style="color: #4f97d7; font-weight: bold;">with</span> tf.Session() <span style="color: #4f97d7; font-weight: bold;">as</span> sess:
    sess.run(init)
    <span style="color: #4f97d7; font-weight: bold;">for</span> epoch <span style="color: #4f97d7; font-weight: bold;">in</span> <span style="color: #4f97d7;">range</span>(41):
        sess.run(tf.assign(lr,0.001*(0.95**epoch)))
        <span style="color: #4f97d7; font-weight: bold;">for</span> batch <span style="color: #4f97d7; font-weight: bold;">in</span> <span style="color: #4f97d7;">range</span>(n_batch):
            <span style="color: #7590db;">batch_xs</span>, <span style="color: #7590db;">batch_ys</span> = mnist.train.next_batch(batch_size)
            sess.run(train_step, feed_dict={x:batch_xs, y:batch_ys,keep_prob:1.0})
        <span style="color: #7590db;">learing_rate</span> = sess.run(lr)
        <span style="color: #7590db;">test_acc</span> = sess.run(accuracy,feed_dict={x:mnist.test.images,
y:mnist.test.labels, keep_prob:1.0})
        <span style="color: #7590db;">train_acc</span> = sess.run(accuracy,feed_dict={x:mnist.train.images,
y:mnist.train.labels, keep_prob:1.0})
        <span style="color: #4f97d7; font-weight: bold;">print</span>(<span style="color: #2d9574;">"&#20934;&#30830;&#29575;&#20026;:&#12288;&#22312;"</span>+<span style="color: #4f97d7;">str</span>(epoch)+<span style="color: #2d9574;">"&#22238;,"</span>+<span style="color: #4f97d7;">str</span>(test_acc)+<span style="color: #2d9574;">",&#20294;&#26159;&#22312;&#35757;&#32451;&#38598;&#20013;&#20026;"</span>+<span style="color: #4f97d7;">str</span>(train_acc)+<span style="color: #2d9574;">"&#21516;&#26102;&#23398;&#20064;&#29575;&#20026;"</span>+<span style="color: #4f97d7;">str</span>(learing_rate))


</pre>
</div>
</div>
</div>
