tf1.org
*** without L regularizer
#+BEGIN_SRC python
  import tensorflow as tf
  import numpy as np
  import matplotlib.pyplot as plt
  BATCH_SIZE = 30
  seed = 2
  rdm = np.random.RandomState(seed)
  X = rdm.randn(300,2)
  Y_ = [int(x0*x0 + x1*x1 < 2) for (x0,x1) in X]
  Y_c = [['red' if y else 'blue'] for y in Y_]
  X = np.vstack(X).reshape(-1,2)
  Y_ = np.vstack(Y_).reshape(-1,1)
  print(X)
  print(Y_)
  print(Y_c)
  plt.scatter(X[:,0],X[:,1], c = np.squeeze(Y_c))
  plt.show()

  def get_weight(shape, regularizer):
      w = tf.Variable(tf.random_normal(shape), dtype = tf.float32)
      tf.add_to_collection('losses', tf.contrib.layers.l2_regularizer(regularizer)(w))
      return w
  def get_bias(shape):
      b = tf.Variable(tf.constant(0.01, shape=shape))
      return b
  x = tf.placeholder(tf.float32, shape=(None, 2))
  y_ = tf.placeholder(tf.float32, shape = (None , 1))
  w1 = get_weight([2,11], 0.01)
  b1 = get_bias([11])
  y1 = tf.nn.relu(tf.matmul(x,w1)+b1)
  w2 = get_weight([11,1],0.01)
  b2 = get_bias([1])
  y = tf.matmul(y1,w2)+b2

  loss_mse = tf.reduce_mean(tf.square(y-y_))
  loss_total = loss_mse + tf.add_n(tf.get_collection('losses'))
  #########without Regularizer#########
  train_step = tf.train.AdamOptimizer(0.0001).minimize(loss_mse)
  with tf.Session() as sess:
      init_op = tf.global_variables_initializer()
      sess.run(init_op)
      STEPS = 40000
      for i in range(STEPS):
          start = (i*BATCH_SIZE) % 300
          end = start + BATCH_SIZE
          sess.run(train_step, feed_dict = {x:X[start:end], y_:Y_[start:end]})
          if i % 2000 == 0:
              loss_mse_v = sess.run(loss_mse, feed_dict={x:X,y_:Y_})
              print('After %d steps, loss is: %f' %(i, loss_mse_v))
      xx, yy = np.mgrid[-3:3:0.01, -3:3:0.01]
      grid = np.c_[xx.ravel(), yy.ravel()]
      probs = sess.run(y, feed_dict={x:grid})
      probs = probs.reshape(xx.shape)
      print ('w1 is \n:', sess.run(w1))
      print ('b1 is \n:', sess.run(b1))
      print ('w2 is \n:', sess.run(w2))
      print ('b2 is \n:', sess.run(b2))
  plt.scatter(X[:,0], X[:,1], c = np.squeeze(Y_c))
  plt.contour(xx, yy, probs, levels = [.5])
  plt.show()


#+END_SRC
*** exponen decay with L regularizer(this has error)
#+BEGIN_SRC python
  import numpy as np
  import matplotlib.pyplot as plt
  ######### import opt4_8_generateds
  ######### import opt4_8_forward


  try:
      import opt4_8_generateds
      import opt4_8_forward
  except:
      import pip 
      pip.main(['install','opt4_8_forward'])
      pip.main(['install','opt4_8_generateds'])
      import opt4_8_generateds
      import opt4_8_forward



  STEPS = 40000
  BATCH_SIZE = 30
  LEARNING_RATE_BASE = 0.001
  LEARNING_RATE_DECAY = 0.999
  REGULARIZER = 0.01

  def backward():
      x = tf.placeholder(tf.float32, shape = (None,2))
      y_ = tf.placeholder(tf.float32, shape = (None,1))

      x , Y_, Y_c = opt4_8_generateds.generateds()
      y = opt4_8_forward.forward(x,REGULARIZER)

      global_steps = tf.Variable(0, trainable= False)
      learning_rate = tf.train.exponential_decay(
          LEARNING_RATE_BASE,
          global_steps,
          300/BATCH_SIZE,
          LEARNING_RATE_DECAY,
          staircase = True)
      loss_mse = tf.reduce_mean(tf.square(y-y_))
      loss_total = loss_mse + tf.add_n(tf.get_collection('losses'))

      train_step = tf.train.AdamOptimizer(learning_rate).minimizer(loss_total)

      with tf.Session() as sess:
          init_op = tf.global_variables_initializer()
          sess.run(init_op)
          for i in range(STEPS):
              start = (i*BATCH_SIZE) % 300
              end = start + BATCH_SIZE
              sess.run(train_step, feed_dict = {x:X[start:end], y_:Y_[start:end]})
              if i % 2000 == 0:
                  loss_v = sess.run(loss_total, feed_dict={x:X,y_:Y_})
                  print('After %d steps, loss is: %f' %(i, loss_v))
          xx, yy = np.mgrid[-3:3:0.01, -3:3:0.01]
          grid = np.c_[xx.ravel(), yy.ravel()]
          probs = sess.run(y, feed_dict={x:grid})
          probs = probs.reshape(xx.shape)

      plt.scatter(X[:,0], X[:,1], c = np.squeeze(Y_c))
      plt.contour(xx, yy, probs, levels = [.5])
      plt.show()

  if __name__ == '__main__':
      backward()


#+END_SRC
