tf1.html
<div id="outline-container-org8496276" class="outline-2">
<h2 id="org8496276">sklearn</h2>
<div class="outline-text-2" id="text-org8496276">
</div>
<div id="outline-container-orgf0a0fc8" class="outline-4">
<h4 id="orgf0a0fc8">decisiontree</h4>
<div class="outline-text-4" id="text-orgf0a0fc8">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">from</span> sklearn.feature_extraction <span style="color: #4f97d7; font-weight: bold;">import</span> DictVectorizer
<span style="color: #4f97d7; font-weight: bold;">import</span> csv
<span style="color: #4f97d7; font-weight: bold;">from</span> sklearn <span style="color: #4f97d7; font-weight: bold;">import</span> preprocessing
<span style="color: #4f97d7; font-weight: bold;">from</span> sklearn <span style="color: #4f97d7; font-weight: bold;">import</span> tree
<span style="color: #4f97d7; font-weight: bold;">from</span> sklearn.externals.six <span style="color: #4f97d7; font-weight: bold;">import</span> StringIO
<span style="color: #4f97d7; font-weight: bold;">import</span> numpy <span style="color: #4f97d7; font-weight: bold;">as</span> np
<span style="color: #4f97d7; font-weight: bold;">import</span> pandas <span style="color: #4f97d7; font-weight: bold;">as</span> pd
<span style="color: #4f97d7; font-weight: bold;">from</span> pylab <span style="color: #4f97d7; font-weight: bold;">import</span> *

<span style="color: #7590db;">allElectronicsData</span> = <span style="color: #4f97d7;">open</span>(<span style="color: #2d9574;">"computer.csv"</span>)
<span style="color: #7590db;">reader</span> = csv.reader(allElectronicsData)
<span style="color: #7590db;">headers</span> = <span style="color: #4f97d7;">next</span>(reader)
<span style="color: #4f97d7; font-weight: bold;">print</span>(headers)
<span style="color: #4f97d7; font-weight: bold;">print</span>(reader)

<span style="color: #7590db;">featureList</span> = []
<span style="color: #7590db;">labelList</span> = []
<span style="color: #4f97d7; font-weight: bold;">for</span> row <span style="color: #4f97d7; font-weight: bold;">in</span> reader:
    labelList.append(row[<span style="color: #4f97d7;">len</span>(row)-1])
    <span style="color: #7590db;">rowDict</span> = {}
    <span style="color: #4f97d7; font-weight: bold;">for</span> i <span style="color: #4f97d7; font-weight: bold;">in</span> <span style="color: #4f97d7;">range</span>(1,<span style="color: #4f97d7;">len</span>(row)-1):
        rowDict[headers[i]] = row[i]
    featureList.append(rowDict)
<span style="color: #4f97d7; font-weight: bold;">print</span>(featureList)

<span style="color: #7590db;">vec</span> = DictVectorizer()
<span style="color: #7590db;">dummyX</span> = vec.fit_transform(featureList).toarray()
<span style="color: #4f97d7; font-weight: bold;">print</span>(<span style="color: #2d9574;">"dummyX: "</span> + <span style="color: #4f97d7;">str</span>(dummyX))
<span style="color: #4f97d7; font-weight: bold;">print</span>(vec.get_feature_names())

<span style="color: #4f97d7; font-weight: bold;">print</span>(<span style="color: #2d9574;">"labeList"</span> + <span style="color: #4f97d7;">str</span>(labelList))
<span style="color: #7590db;">lb</span> = preprocessing.LabelBinarizer()
<span style="color: #7590db;">dummyY</span> = lb.fit_transform(labelList)
<span style="color: #4f97d7; font-weight: bold;">print</span>(<span style="color: #2d9574;">"dummyY:"</span> + <span style="color: #4f97d7;">str</span>(dummyY))

<span style="color: #7590db;">clf</span> = tree.DecisionTreeClassifier(criterion= <span style="color: #2d9574;">'entropy'</span>)
<span style="color: #7590db;">clf</span> = clf.fit(dummyX,dummyY)
<span style="color: #4f97d7; font-weight: bold;">print</span>(<span style="color: #2d9574;">"clf :"</span> + <span style="color: #4f97d7;">str</span>(clf))

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">save as dot</span>
<span style="color: #4f97d7; font-weight: bold;">with</span> <span style="color: #4f97d7;">open</span>(<span style="color: #2d9574;">"output.dot"</span>,<span style="color: #2d9574;">"w"</span>) <span style="color: #4f97d7; font-weight: bold;">as</span> f:
    <span style="color: #7590db;">f</span> = tree.export_graphviz(clf, feature_names= vec.get_feature_names(), out_file = f)

<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">in terminnal gives the flowwing comands</span>

<span style="color: #2aa1ae; background-color: #292e34;">#    </span><span style="color: #2aa1ae; background-color: #292e34;">dot -Tpdf -O output.dot</span>
<span style="color: #2aa1ae; background-color: #292e34;">#    </span><span style="color: #2aa1ae; background-color: #292e34;">xdg-open output.pdf</span>

</pre>
</div>
</div>
</div>
<div id="outline-container-org0e51e60" class="outline-4">
<h4 id="org0e51e60">cross validation 1</h4>
<div class="outline-text-4" id="text-org0e51e60">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">View more python learning tutorial on my Youtube and Youku channel!!!</span>

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Youtube video tutorial: https://www.youtube.com/channel/UCdyjiB5H8Pu7aDTNVXTTpcg</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Youku video tutorial: http://i.youku.com/pythontutorial</span>

<span style="color: #9f8766;">"""</span>
<span style="color: #9f8766;">Please note, this code is only for python 3+. If you are using python 2+, please modify the code accordingly.</span>
<span style="color: #9f8766;">"""</span>
<span style="color: #4f97d7; font-weight: bold;">from</span> __future__ <span style="color: #4f97d7; font-weight: bold;">import</span> print_function
<span style="color: #4f97d7; font-weight: bold;">from</span> sklearn.datasets <span style="color: #4f97d7; font-weight: bold;">import</span> load_iris
<span style="color: #4f97d7; font-weight: bold;">from</span> sklearn.cross_validation <span style="color: #4f97d7; font-weight: bold;">import</span> train_test_split
<span style="color: #4f97d7; font-weight: bold;">from</span> sklearn.neighbors <span style="color: #4f97d7; font-weight: bold;">import</span> KNeighborsClassifier

<span style="color: #7590db;">iris</span> = load_iris()
<span style="color: #7590db;">X</span> = iris.data
<span style="color: #7590db;">y</span> = iris.target

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">test train split #</span>
<span style="color: #7590db;">X_train</span>, <span style="color: #7590db;">X_test</span>, <span style="color: #7590db;">y_train</span>, <span style="color: #7590db;">y_test</span> = train_test_split(X, y, random_state=4)
<span style="color: #7590db;">knn</span> = KNeighborsClassifier(n_neighbors=5)
knn.fit(X_train, y_train)
<span style="color: #7590db;">y_pred</span> = knn.predict(X_test)
<span style="color: #4f97d7; font-weight: bold;">print</span>(knn.score(X_test, y_test))

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">this is cross_val_score #</span>
<span style="color: #4f97d7; font-weight: bold;">from</span> sklearn.cross_validation <span style="color: #4f97d7; font-weight: bold;">import</span> cross_val_score
<span style="color: #7590db;">knn</span> = KNeighborsClassifier(n_neighbors=5)
<span style="color: #7590db;">scores</span> = cross_val_score(knn, X, y, cv=5, scoring=<span style="color: #2d9574;">'accuracy'</span>)
<span style="color: #4f97d7; font-weight: bold;">print</span>(scores)

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">this is how to use cross_val_score to choose model and configs #</span>
<span style="color: #4f97d7; font-weight: bold;">from</span> sklearn.cross_validation <span style="color: #4f97d7; font-weight: bold;">import</span> cross_val_score
<span style="color: #4f97d7; font-weight: bold;">import</span> matplotlib.pyplot <span style="color: #4f97d7; font-weight: bold;">as</span> plt
<span style="color: #7590db;">k_range</span> = <span style="color: #4f97d7;">range</span>(1, 31)
<span style="color: #7590db;">k_scores</span> = []
<span style="color: #4f97d7; font-weight: bold;">for</span> k <span style="color: #4f97d7; font-weight: bold;">in</span> k_range:
    <span style="color: #7590db;">knn</span> = KNeighborsClassifier(n_neighbors=k)
    <span style="color: #7590db;">loss</span> = -cross_val_score(knn, X, y, cv=10, scoring=<span style="color: #2d9574;">'mean_squared_error'</span>) <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">for regression</span>
<span style="color: #2aa1ae; background-color: #292e34;">##    </span><span style="color: #2aa1ae; background-color: #292e34;">scores = cross_val_score(knn, X, y, cv=10, scoring='accuracy') # for classification</span>
    k_scores.append(loss.mean())

plt.plot(k_range, k_scores)
plt.xlabel(<span style="color: #2d9574;">'Value of K for KNN'</span>)
plt.ylabel(<span style="color: #2d9574;">'Cross-Validated Accuracy'</span>)
plt.show()


</pre>
</div>
</div>
</div>
