tf1.org
*** cross validation 2
#+BEGIN_SRC python
  # View more python learning tutorial on my Youtube and Youku channel!!!

  # Youtube video tutorial: https://www.youtube.com/channel/UCdyjiB5H8Pu7aDTNVXTTpcg
  # Youku video tutorial: http://i.youku.com/pythontutorial

  """
  Please note, this code is only for python 3+. If you are using python 2+, please modify the code accordingly.
  """
  from __future__ import print_function
  from sklearn.learning_curve import  learning_curve
  from sklearn.datasets import load_digits
  from sklearn.svm import SVC
  import matplotlib.pyplot as plt
  import numpy as np

  digits = load_digits()
  X = digits.data
  y = digits.target
  train_sizes, train_loss, test_loss= learning_curve(
          SVC(gamma=0.01), X, y, cv=10, scoring='mean_squared_error',
          train_sizes=[0.1, 0.25, 0.5, 0.75, 1])
  train_loss_mean = -np.mean(train_loss, axis=1)
  test_loss_mean = -np.mean(test_loss, axis=1)

  plt.plot(train_sizes, train_loss_mean, 'o-', color="r",
               label="Training")
  plt.plot(train_sizes, test_loss_mean, 'o-', color="g",
               label="Cross-validation")

  plt.xlabel("Training examples")
  plt.ylabel("Loss")
  plt.legend(loc="best")
  plt.show()


#+END_SRC

*** corss validation 3
#+BEGIN_SRC python
  # View more python learning tutorial on my Youtube and Youku channel!!!

  # Youtube video tutorial: https://www.youtube.com/channel/UCdyjiB5H8Pu7aDTNVXTTpcg
  # Youku video tutorial: http://i.youku.com/pythontutorial

  """
  Please note, this code is only for python 3+. If you are using python 2+, please modify the code accordingly.
  """
  from __future__ import print_function
  from sklearn.learning_curve import  validation_curve
  from sklearn.datasets import load_digits
  from sklearn.svm import SVC
  import matplotlib.pyplot as plt
  import numpy as np

  digits = load_digits()
  X = digits.data
  y = digits.target
  param_range = np.logspace(-6, -2.3, 5)
  train_loss, test_loss = validation_curve(
          SVC(), X, y, param_name='gamma', param_range=param_range, cv=10,
          scoring='mean_squared_error')
  train_loss_mean = -np.mean(train_loss, axis=1)
  test_loss_mean = -np.mean(test_loss, axis=1)

  plt.plot(param_range, train_loss_mean, 'o-', color="r",
               label="Training")
  plt.plot(param_range, test_loss_mean, 'o-', color="g",
               label="Cross-validation")

  plt.xlabel("gamma")
  plt.ylabel("Loss")
  plt.legend(loc="best")
  plt.show()


#+END_SRC
*** data application
#+BEGIN_SRC python
  # View more python learning tutorial on my Youtube and Youku channel!!!

  # Youtube video tutorial: https://www.youtube.com/channel/UCdyjiB5H8Pu7aDTNVXTTpcg
  # Youku video tutorial: http://i.youku.com/pythontutorial

  """
  Please note, this code is only for python 3+. If you are using python 2+, please modify the code accordingly.
  """
  from __future__ import print_function
  from sklearn import datasets
  from sklearn.linear_model import LinearRegression
  import matplotlib.pyplot as plt

  loaded_data = datasets.load_boston()
  data_X = loaded_data.data
  data_y = loaded_data.target

  model = LinearRegression()
  model.fit(data_X, data_y)

  print(model.predict(data_X[:4, :]))
  print(data_y[:4])

  X, y = datasets.make_regression(n_samples=100, n_features=1, n_targets=1, noise=1)
  plt.scatter(X, y)
  plt.show()


#+END_SRC
*** eigenschaft function
#+BEGIN_SRC python
  # View more python learning tutorial on my Youtube and Youku channel!!!

  # Youtube video tutorial: https://www.youtube.com/channel/UCdyjiB5H8Pu7aDTNVXTTpcg
  # Youku video tutorial: http://i.youku.com/pythontutorial

  """
  Please note, this code is only for python 3+. If you are using python 2+, please modify the code accordingly.
  """
  from __future__ import print_function
  from sklearn import datasets
  from sklearn.linear_model import LinearRegression

  loaded_data = datasets.load_boston()
  data_X = loaded_data.data
  data_y = loaded_data.target

  model = LinearRegression()
  model.fit(data_X, data_y)

  print(model.predict(data_X[:4, :]))
  print(model.coef_)
  print(model.intercept_)
  print(model.get_params())
  print(model.score(data_X, data_y)) # R^2 coefficient of determination


#+END_SRC
