tf1.html

<div id="outline-container-org9b03926" class="outline-4">
<h4 id="org9b03926">cross validation 2</h4>
<div class="outline-text-4" id="text-org9b03926">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">View more python learning tutorial on my Youtube and Youku channel!!!</span>

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Youtube video tutorial: https://www.youtube.com/channel/UCdyjiB5H8Pu7aDTNVXTTpcg</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Youku video tutorial: http://i.youku.com/pythontutorial</span>

<span style="color: #9f8766;">"""</span>
<span style="color: #9f8766;">Please note, this code is only for python 3+. If you are using python 2+, please modify the code accordingly.</span>
<span style="color: #9f8766;">"""</span>
<span style="color: #4f97d7; font-weight: bold;">from</span> __future__ <span style="color: #4f97d7; font-weight: bold;">import</span> print_function
<span style="color: #4f97d7; font-weight: bold;">from</span> sklearn.learning_curve <span style="color: #4f97d7; font-weight: bold;">import</span>  learning_curve
<span style="color: #4f97d7; font-weight: bold;">from</span> sklearn.datasets <span style="color: #4f97d7; font-weight: bold;">import</span> load_digits
<span style="color: #4f97d7; font-weight: bold;">from</span> sklearn.svm <span style="color: #4f97d7; font-weight: bold;">import</span> SVC
<span style="color: #4f97d7; font-weight: bold;">import</span> matplotlib.pyplot <span style="color: #4f97d7; font-weight: bold;">as</span> plt
<span style="color: #4f97d7; font-weight: bold;">import</span> numpy <span style="color: #4f97d7; font-weight: bold;">as</span> np

<span style="color: #7590db;">digits</span> = load_digits()
<span style="color: #7590db;">X</span> = digits.data
<span style="color: #7590db;">y</span> = digits.target
<span style="color: #7590db;">train_sizes</span>, <span style="color: #7590db;">train_loss</span>, <span style="color: #7590db;">test_loss</span>= learning_curve(
        SVC(gamma=0.01), X, y, cv=10, scoring=<span style="color: #2d9574;">'mean_squared_error'</span>,
        train_sizes=[0.1, 0.25, 0.5, 0.75, 1])
<span style="color: #7590db;">train_loss_mean</span> = -np.mean(train_loss, axis=1)
<span style="color: #7590db;">test_loss_mean</span> = -np.mean(test_loss, axis=1)

plt.plot(train_sizes, train_loss_mean, <span style="color: #2d9574;">'o-'</span>, color=<span style="color: #2d9574;">"r"</span>,
             label=<span style="color: #2d9574;">"Training"</span>)
plt.plot(train_sizes, test_loss_mean, <span style="color: #2d9574;">'o-'</span>, color=<span style="color: #2d9574;">"g"</span>,
             label=<span style="color: #2d9574;">"Cross-validation"</span>)

plt.xlabel(<span style="color: #2d9574;">"Training examples"</span>)
plt.ylabel(<span style="color: #2d9574;">"Loss"</span>)
plt.legend(loc=<span style="color: #2d9574;">"best"</span>)
plt.show()


</pre>
</div>
</div>
</div>

<div id="outline-container-org5fe5278" class="outline-4">
<h4 id="org5fe5278">corss validation 3</h4>
<div class="outline-text-4" id="text-org5fe5278">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">View more python learning tutorial on my Youtube and Youku channel!!!</span>

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Youtube video tutorial: https://www.youtube.com/channel/UCdyjiB5H8Pu7aDTNVXTTpcg</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Youku video tutorial: http://i.youku.com/pythontutorial</span>

<span style="color: #9f8766;">"""</span>
<span style="color: #9f8766;">Please note, this code is only for python 3+. If you are using python 2+, please modify the code accordingly.</span>
<span style="color: #9f8766;">"""</span>
<span style="color: #4f97d7; font-weight: bold;">from</span> __future__ <span style="color: #4f97d7; font-weight: bold;">import</span> print_function
<span style="color: #4f97d7; font-weight: bold;">from</span> sklearn.learning_curve <span style="color: #4f97d7; font-weight: bold;">import</span>  validation_curve
<span style="color: #4f97d7; font-weight: bold;">from</span> sklearn.datasets <span style="color: #4f97d7; font-weight: bold;">import</span> load_digits
<span style="color: #4f97d7; font-weight: bold;">from</span> sklearn.svm <span style="color: #4f97d7; font-weight: bold;">import</span> SVC
<span style="color: #4f97d7; font-weight: bold;">import</span> matplotlib.pyplot <span style="color: #4f97d7; font-weight: bold;">as</span> plt
<span style="color: #4f97d7; font-weight: bold;">import</span> numpy <span style="color: #4f97d7; font-weight: bold;">as</span> np

<span style="color: #7590db;">digits</span> = load_digits()
<span style="color: #7590db;">X</span> = digits.data
<span style="color: #7590db;">y</span> = digits.target
<span style="color: #7590db;">param_range</span> = np.logspace(-6, -2.3, 5)
<span style="color: #7590db;">train_loss</span>, <span style="color: #7590db;">test_loss</span> = validation_curve(
        SVC(), X, y, param_name=<span style="color: #2d9574;">'gamma'</span>, param_range=param_range, cv=10,
        scoring=<span style="color: #2d9574;">'mean_squared_error'</span>)
<span style="color: #7590db;">train_loss_mean</span> = -np.mean(train_loss, axis=1)
<span style="color: #7590db;">test_loss_mean</span> = -np.mean(test_loss, axis=1)

plt.plot(param_range, train_loss_mean, <span style="color: #2d9574;">'o-'</span>, color=<span style="color: #2d9574;">"r"</span>,
             label=<span style="color: #2d9574;">"Training"</span>)
plt.plot(param_range, test_loss_mean, <span style="color: #2d9574;">'o-'</span>, color=<span style="color: #2d9574;">"g"</span>,
             label=<span style="color: #2d9574;">"Cross-validation"</span>)

plt.xlabel(<span style="color: #2d9574;">"gamma"</span>)
plt.ylabel(<span style="color: #2d9574;">"Loss"</span>)
plt.legend(loc=<span style="color: #2d9574;">"best"</span>)
plt.show()


</pre>
</div>
</div>
</div>
<div id="outline-container-orge67b345" class="outline-4">
<h4 id="orge67b345">data application</h4>
<div class="outline-text-4" id="text-orge67b345">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">View more python learning tutorial on my Youtube and Youku channel!!!</span>

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Youtube video tutorial: https://www.youtube.com/channel/UCdyjiB5H8Pu7aDTNVXTTpcg</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Youku video tutorial: http://i.youku.com/pythontutorial</span>

<span style="color: #9f8766;">"""</span>
<span style="color: #9f8766;">Please note, this code is only for python 3+. If you are using python 2+, please modify the code accordingly.</span>
<span style="color: #9f8766;">"""</span>
<span style="color: #4f97d7; font-weight: bold;">from</span> __future__ <span style="color: #4f97d7; font-weight: bold;">import</span> print_function
<span style="color: #4f97d7; font-weight: bold;">from</span> sklearn <span style="color: #4f97d7; font-weight: bold;">import</span> datasets
<span style="color: #4f97d7; font-weight: bold;">from</span> sklearn.linear_model <span style="color: #4f97d7; font-weight: bold;">import</span> LinearRegression
<span style="color: #4f97d7; font-weight: bold;">import</span> matplotlib.pyplot <span style="color: #4f97d7; font-weight: bold;">as</span> plt

<span style="color: #7590db;">loaded_data</span> = datasets.load_boston()
<span style="color: #7590db;">data_X</span> = loaded_data.data
<span style="color: #7590db;">data_y</span> = loaded_data.target

<span style="color: #7590db;">model</span> = LinearRegression()
model.fit(data_X, data_y)

<span style="color: #4f97d7; font-weight: bold;">print</span>(model.predict(data_X[:4, :]))
<span style="color: #4f97d7; font-weight: bold;">print</span>(data_y[:4])

<span style="color: #7590db;">X</span>, <span style="color: #7590db;">y</span> = datasets.make_regression(n_samples=100, n_features=1, n_targets=1, noise=1)
plt.scatter(X, y)
plt.show()


</pre>
</div>
</div>
</div>
<div id="outline-container-orgd80d682" class="outline-4">
<h4 id="orgd80d682">eigenschaft function</h4>
<div class="outline-text-4" id="text-orgd80d682">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">View more python learning tutorial on my Youtube and Youku channel!!!</span>

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Youtube video tutorial: https://www.youtube.com/channel/UCdyjiB5H8Pu7aDTNVXTTpcg</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Youku video tutorial: http://i.youku.com/pythontutorial</span>

<span style="color: #9f8766;">"""</span>
<span style="color: #9f8766;">Please note, this code is only for python 3+. If you are using python 2+, please modify the code accordingly.</span>
<span style="color: #9f8766;">"""</span>
<span style="color: #4f97d7; font-weight: bold;">from</span> __future__ <span style="color: #4f97d7; font-weight: bold;">import</span> print_function
<span style="color: #4f97d7; font-weight: bold;">from</span> sklearn <span style="color: #4f97d7; font-weight: bold;">import</span> datasets
<span style="color: #4f97d7; font-weight: bold;">from</span> sklearn.linear_model <span style="color: #4f97d7; font-weight: bold;">import</span> LinearRegression

<span style="color: #7590db;">loaded_data</span> = datasets.load_boston()
<span style="color: #7590db;">data_X</span> = loaded_data.data
<span style="color: #7590db;">data_y</span> = loaded_data.target

<span style="color: #7590db;">model</span> = LinearRegression()
model.fit(data_X, data_y)

<span style="color: #4f97d7; font-weight: bold;">print</span>(model.predict(data_X[:4, :]))
<span style="color: #4f97d7; font-weight: bold;">print</span>(model.coef_)
<span style="color: #4f97d7; font-weight: bold;">print</span>(model.intercept_)
<span style="color: #4f97d7; font-weight: bold;">print</span>(model.get_params())
<span style="color: #4f97d7; font-weight: bold;">print</span>(model.score(data_X, data_y)) <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">R^2 coefficient of determination</span>


</pre>
</div>
</div>
</div>
