tf1.org
*** iris
#+BEGIN_SRC python
  # View more python learning tutorial on my Youtube and Youku channel!!!

  # Youtube video tutorial: https://www.youtube.com/channel/UCdyjiB5H8Pu7aDTNVXTTpcg
  # Youku video tutorial: http://i.youku.com/pythontutorial

  """
  Please note, this code is only for python 3+. If you are using python 2+, please modify the code accordingly.
  """
  from __future__ import print_function
  from sklearn import datasets
  from sklearn.model_selection import train_test_split
  from sklearn.neighbors import KNeighborsClassifier

  iris = datasets.load_iris()
  iris_X = iris.data
  iris_y = iris.target

  ##print(iris_X[:2, :])
  ##print(iris_y)

  X_train, X_test, y_train, y_test = train_test_split(
      iris_X, iris_y, test_size=0.3)

  ##print(y_train)

  knn = KNeighborsClassifier()
  knn.fit(X_train, y_train)
  print(knn.predict(X_test))
  print(y_test)


#+END_SRC
*** normnalization
#+BEGIN_SRC python
# View more python learning tutorial on my Youtube and Youku channel!!!

# Youtube video tutorial: https://www.youtube.com/channel/UCdyjiB5H8Pu7aDTNVXTTpcg
# Youku video tutorial: http://i.youku.com/pythontutorial

"""
Please note, this code is only for python 3+. If you are using python 2+, please modify the code accordingly.
"""
from __future__ import print_function
from sklearn import preprocessing
import numpy as np
from sklearn.model_selection import train_test_split
from sklearn.datasets.samples_generator import make_classification
from sklearn.svm import SVC
import matplotlib.pyplot as plt

a = np.array([[10, 2.7, 3.6],
                     [-100, 5, -2],
                     [120, 20, 40]], dtype=np.float64)
print(a)
print(preprocessing.scale(a))

X, y = make_classification(n_samples=300, n_features=2 , n_redundant=0, n_informative=2, random_state=22, n_clusters_per_class=1, scale=100)
plt.scatter(X[:, 0], X[:, 1], c=y)
plt.show()
X = preprocessing.scale(X)    # normalization step
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=.3)
clf = SVC()
clf.fit(X_train, y_train)
print(clf.score(X_test, y_test))


#+END_SRC
*** save load
#+BEGIN_SRC python
  # View more python tutorials on my Youtube and Youku channel!!!

  # Youtube video tutorial: https://www.youtube.com/channel/UCdyjiB5H8Pu7aDTNVXTTpcg
  # Youku video tutorial: http://i.youku.com/pythontutorial

  """
  Please note, this code is only for python 3+. If you are using python 2+, please modify the code accordingly.
  """
  from __future__ import print_function
  from sklearn import svm
  from sklearn import datasets

  clf = svm.SVC()
  iris = datasets.load_iris()
  X, y = iris.data, iris.target
  clf.fit(X, y)

  # # method 1: pickle
  # import pickle
  # # save
  # with open('save/clf.pickle', 'wb') as f:
  #     pickle.dump(clf, f)
  # # restore
  # with open('save/clf.pickle', 'rb') as f:
  #    clf2 = pickle.load(f)
  #    print(clf2.predict(X[0:1]))

  # method 2: joblib
  from sklearn.externals import joblib
  # Save
  joblib.dump(clf, 'save/clf.pkl')
  # restore
  clf3 = joblib.load('save/clf.pkl')
  print(clf3.predict(X[0:1]))


#+END_SRC
* theano 
