tf1.html
<div id="outline-container-orge1f17b0" class="outline-4">
<h4 id="orge1f17b0">iris</h4>
<div class="outline-text-4" id="text-orge1f17b0">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">View more python learning tutorial on my Youtube and Youku channel!!!</span>

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Youtube video tutorial: https://www.youtube.com/channel/UCdyjiB5H8Pu7aDTNVXTTpcg</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Youku video tutorial: http://i.youku.com/pythontutorial</span>

<span style="color: #9f8766;">"""</span>
<span style="color: #9f8766;">Please note, this code is only for python 3+. If you are using python 2+, please modify the code accordingly.</span>
<span style="color: #9f8766;">"""</span>
<span style="color: #4f97d7; font-weight: bold;">from</span> __future__ <span style="color: #4f97d7; font-weight: bold;">import</span> print_function
<span style="color: #4f97d7; font-weight: bold;">from</span> sklearn <span style="color: #4f97d7; font-weight: bold;">import</span> datasets
<span style="color: #4f97d7; font-weight: bold;">from</span> sklearn.model_selection <span style="color: #4f97d7; font-weight: bold;">import</span> train_test_split
<span style="color: #4f97d7; font-weight: bold;">from</span> sklearn.neighbors <span style="color: #4f97d7; font-weight: bold;">import</span> KNeighborsClassifier

<span style="color: #7590db;">iris</span> = datasets.load_iris()
<span style="color: #7590db;">iris_X</span> = iris.data
<span style="color: #7590db;">iris_y</span> = iris.target

<span style="color: #2aa1ae; background-color: #292e34;">##</span><span style="color: #2aa1ae; background-color: #292e34;">print(iris_X[:2, :])</span>
<span style="color: #2aa1ae; background-color: #292e34;">##</span><span style="color: #2aa1ae; background-color: #292e34;">print(iris_y)</span>

<span style="color: #7590db;">X_train</span>, <span style="color: #7590db;">X_test</span>, <span style="color: #7590db;">y_train</span>, <span style="color: #7590db;">y_test</span> = train_test_split(
    iris_X, iris_y, test_size=0.3)

<span style="color: #2aa1ae; background-color: #292e34;">##</span><span style="color: #2aa1ae; background-color: #292e34;">print(y_train)</span>

<span style="color: #7590db;">knn</span> = KNeighborsClassifier()
knn.fit(X_train, y_train)
<span style="color: #4f97d7; font-weight: bold;">print</span>(knn.predict(X_test))
<span style="color: #4f97d7; font-weight: bold;">print</span>(y_test)


</pre>
</div>
</div>
</div>
<div id="outline-container-org6be5985" class="outline-4">
<h4 id="org6be5985">normnalization</h4>
<div class="outline-text-4" id="text-org6be5985">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">View more python learning tutorial on my Youtube and Youku channel!!!</span>

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Youtube video tutorial: https://www.youtube.com/channel/UCdyjiB5H8Pu7aDTNVXTTpcg</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Youku video tutorial: http://i.youku.com/pythontutorial</span>

<span style="color: #9f8766;">"""</span>
<span style="color: #9f8766;">Please note, this code is only for python 3+. If you are using python 2+, please modify the code accordingly.</span>
<span style="color: #9f8766;">"""</span>
<span style="color: #4f97d7; font-weight: bold;">from</span> __future__ <span style="color: #4f97d7; font-weight: bold;">import</span> print_function
<span style="color: #4f97d7; font-weight: bold;">from</span> sklearn <span style="color: #4f97d7; font-weight: bold;">import</span> preprocessing
<span style="color: #4f97d7; font-weight: bold;">import</span> numpy <span style="color: #4f97d7; font-weight: bold;">as</span> np
<span style="color: #4f97d7; font-weight: bold;">from</span> sklearn.model_selection <span style="color: #4f97d7; font-weight: bold;">import</span> train_test_split
<span style="color: #4f97d7; font-weight: bold;">from</span> sklearn.datasets.samples_generator <span style="color: #4f97d7; font-weight: bold;">import</span> make_classification
<span style="color: #4f97d7; font-weight: bold;">from</span> sklearn.svm <span style="color: #4f97d7; font-weight: bold;">import</span> SVC
<span style="color: #4f97d7; font-weight: bold;">import</span> matplotlib.pyplot <span style="color: #4f97d7; font-weight: bold;">as</span> plt

<span style="color: #7590db;">a</span> = np.array([[10, 2.7, 3.6],
                     [-100, 5, -2],
                     [120, 20, 40]], dtype=np.float64)
<span style="color: #4f97d7; font-weight: bold;">print</span>(a)
<span style="color: #4f97d7; font-weight: bold;">print</span>(preprocessing.scale(a))

<span style="color: #7590db;">X</span>, <span style="color: #7590db;">y</span> = make_classification(n_samples=300, n_features=2 , n_redundant=0, n_informative=2, random_state=22, n_clusters_per_class=1, scale=100)
plt.scatter(X[:, 0], X[:, 1], c=y)
plt.show()
<span style="color: #7590db;">X</span> = preprocessing.scale(X)    <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">normalization step</span>
<span style="color: #7590db;">X_train</span>, <span style="color: #7590db;">X_test</span>, <span style="color: #7590db;">y_train</span>, <span style="color: #7590db;">y_test</span> = train_test_split(X, y, test_size=.3)
<span style="color: #7590db;">clf</span> = SVC()
clf.fit(X_train, y_train)
<span style="color: #4f97d7; font-weight: bold;">print</span>(clf.score(X_test, y_test))


</pre>
</div>
</div>
</div>
<div id="outline-container-orgf700e77" class="outline-4">
<h4 id="orgf700e77">save load</h4>
<div class="outline-text-4" id="text-orgf700e77">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">View more python tutorials on my Youtube and Youku channel!!!</span>

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Youtube video tutorial: https://www.youtube.com/channel/UCdyjiB5H8Pu7aDTNVXTTpcg</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Youku video tutorial: http://i.youku.com/pythontutorial</span>

<span style="color: #9f8766;">"""</span>
<span style="color: #9f8766;">Please note, this code is only for python 3+. If you are using python 2+, please modify the code accordingly.</span>
<span style="color: #9f8766;">"""</span>
<span style="color: #4f97d7; font-weight: bold;">from</span> __future__ <span style="color: #4f97d7; font-weight: bold;">import</span> print_function
<span style="color: #4f97d7; font-weight: bold;">from</span> sklearn <span style="color: #4f97d7; font-weight: bold;">import</span> svm
<span style="color: #4f97d7; font-weight: bold;">from</span> sklearn <span style="color: #4f97d7; font-weight: bold;">import</span> datasets

<span style="color: #7590db;">clf</span> = svm.SVC()
<span style="color: #7590db;">iris</span> = datasets.load_iris()
<span style="color: #7590db;">X</span>, <span style="color: #7590db;">y</span> = iris.data, iris.target
clf.fit(X, y)

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;"># method 1: pickle</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">import pickle</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;"># save</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">with open('save/clf.pickle', 'wb') as f:</span>
<span style="color: #2aa1ae; background-color: #292e34;">#     </span><span style="color: #2aa1ae; background-color: #292e34;">pickle.dump(clf, f)</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;"># restore</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">with open('save/clf.pickle', 'rb') as f:</span>
<span style="color: #2aa1ae; background-color: #292e34;">#    </span><span style="color: #2aa1ae; background-color: #292e34;">clf2 = pickle.load(f)</span>
<span style="color: #2aa1ae; background-color: #292e34;">#    </span><span style="color: #2aa1ae; background-color: #292e34;">print(clf2.predict(X[0:1]))</span>

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">method 2: joblib</span>
<span style="color: #4f97d7; font-weight: bold;">from</span> sklearn.externals <span style="color: #4f97d7; font-weight: bold;">import</span> joblib
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Save</span>
joblib.dump(clf, <span style="color: #2d9574;">'save/clf.pkl'</span>)
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">restore</span>
<span style="color: #7590db;">clf3</span> = joblib.load(<span style="color: #2d9574;">'save/clf.pkl'</span>)
<span style="color: #4f97d7; font-weight: bold;">print</span>(clf3.predict(X[0:1]))


</pre>
</div>
</div>
</div>
</div>
