tf1.html
<div id="outline-container-org9c62a5e" class="outline-2">
<h2 id="org9c62a5e">theano</h2>
<div class="outline-text-2" id="text-org9c62a5e">
</div>
<div id="outline-container-orgdac2a39" class="outline-4">
<h4 id="orgdac2a39">basic</h4>
<div class="outline-text-4" id="text-orgdac2a39">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">View more python tutorials on my Youtube and Youku channel!!!</span>

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Youtube video tutorial: https://www.youtube.com/channel/UCdyjiB5H8Pu7aDTNVXTTpcg</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Youku video tutorial: http://i.youku.com/pythontutorial</span>

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">4 - basic usage</span>
<span style="color: #2aa1ae; background-color: #292e34;">#   </span><span style="color: #2aa1ae; background-color: #292e34;">from __future__ import print_function</span>
<span style="color: #4f97d7; font-weight: bold;">import</span> numpy <span style="color: #4f97d7; font-weight: bold;">as</span> np
<span style="color: #4f97d7; font-weight: bold;">import</span> theano.tensor <span style="color: #4f97d7; font-weight: bold;">as</span> T
<span style="color: #4f97d7; font-weight: bold;">from</span> theano <span style="color: #4f97d7; font-weight: bold;">import</span> function

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">basic</span>
<span style="color: #7590db;">x</span> = T.dscalar(<span style="color: #2d9574;">'x'</span>)
<span style="color: #7590db;">y</span> = T.dscalar(<span style="color: #2d9574;">'y'</span>)
<span style="color: #7590db;">z</span> = x+y     <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">define the actual function in here</span>
<span style="color: #7590db;">f</span> = function([x, y], z)  <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">the inputs are in [], and the output in the "z"</span>

<span style="color: #4f97d7; font-weight: bold;">print</span>(f(2,3))  <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">only give the inputs "x and y" for this function, then it will calculate the output "z"</span>

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;"># to pretty-print the function</span>
<span style="color: #4f97d7; font-weight: bold;">from</span> theano <span style="color: #4f97d7; font-weight: bold;">import</span> pp
<span style="color: #4f97d7; font-weight: bold;">print</span>(pp(z))

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;"># how about matrix</span>
<span style="color: #7590db;">x</span> = T.dmatrix(<span style="color: #2d9574;">'x'</span>)
<span style="color: #7590db;">y</span> = T.dmatrix(<span style="color: #2d9574;">'y'</span>)
<span style="color: #7590db;">z</span> = x + y
<span style="color: #7590db;">f</span> = function([x, y], z)
<span style="color: #4f97d7; font-weight: bold;">print</span>(f(np.arange(12).reshape((3,4)), 10*np.ones((3,4))))


</pre>
</div>
</div>
</div>
</div>



<div id="outline-container-orgad42593" class="outline-2">
<h2 id="orgad42593">Backlinks</h2>
</div>


<div id="outline-container-org901d760" class="outline-2">
<h2 id="org901d760">1 Backlinks</h2>
<div class="outline-text-2" id="text-org901d760">
</div>
<div id="outline-container-org9b1896a" class="outline-3">
<h3 id="org9b1896a"><a href="file:///home/sx/Dropbox/subjects/AI.html">AI</a></h3>
<div class="outline-text-3" id="text-org9b1896a">
<p>
<a href="file:///home/sx/Dropbox/Projects/tensorflow/tf1.html">tf1</a>
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: sx</p>
<p class="date">Created: 2020-05-23 Sa 12:00</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
